Repository: mu-editor/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: cs, ja, ta

source: # Write your code here :-)
cs: # Sem napiště svůj kód :-)
ja: # ここにコードを書いてね :-)
ta: # உங்கள் குறியீட்டை இங்கே எழுதுங்கள் :-)

source: The file contains characters Mu expects to be encoded as {0} or as the computer's default encoding {1}, but which are encoded in some other way. If this file was saved in another application, re-save the file via the 'Save as' option and set the encoding to {0}
cs: Soubor obsahuje znaky, u kterých Mu očakává, že budou zakódované jako {0} alebo jako výchozí kódování počítače {1}. Jsou však zakódované jiným způsobom. Pokud byl tento soubor uložený v jiné aplikaci, uložte ho znova s možností 'Uložit jako' a nastavte kódování na {0}
ja: Mu が前提としているファイルエンコーディングは {0} かコンピュータのデフォルトの {1} ですが、他の方法でエンコードされています。 このファイルが別のアプリケーションで保存されたのであれば、「別名で保存」オプションでエンコーディングを {0} を設定して再保存してください。
ta: கோப்பில் MU {0} அல்லது கணினியின் இயல்புநிலை குறியாக்கம் {1 as என குறியாக்கம் செய்ய எதிர்பார்க்கும் எழுத்துக்களைக் கொண்டுள்ளது, ஆனால் அவை வேறு வழியில் குறியாக்கம் செய்யப்படுகின்றன. இந்த கோப்பு மற்றொரு பயன்பாட்டில் சேமிக்கப்பட்டிருந்தால், கோப்பை 'சேமி' விருப்பத்தின் வழியாக மீண்டும் சேமித்து குறியாக்கத்தை {0 bet ஆக அமைக்கவும்

source: The file "{}" is already open.
cs: Soubor "{}" je už otevřený.
ja: ファイル "{}" は既に開いています。
ta: "{}" கோப்பு ஏற்கனவே திறந்திருக்கும்.

source: Mu cannot read the characters in {}
cs: Mu nedokáže přečíst znaky v {}
ja: Mu は {} の文字を読み込めませんでした。
ta: Mu {filh இல் எழுத்துக்களைப் படிக்க முடியாது

source: Mu was not able to open this file
cs: Mu se nepodařilo otevřít tento soubor
ja: Mu はこのファイルを開けませんでした
ta: MU இந்த கோப்பை திறக்க முடியவில்லை

source: Currently Mu only works with Python source files or hex files created with embedded MicroPython code.
cs: Aktuálně dokáže Mu pracovat pouze se zdrojovými soubory jazyka Python anebo s binárními soubory vytvořenými pomocí kódu v jazyku MicroPython.
ja: 現在のところ Mu は Python ソースファイルまたは MicroPython コードが埋め込まれた hex ファイルだけを扱えます。
ta: தற்போது MU பைதான் மூல கோப்புகள் அல்லது உட்பொதிக்கப்பட்ட மைக்ரோபிதான் குறியீட்டைக் கொண்டு உருவாக்கப்பட்ட ஹெக்ஸ் கோப்புகளுடன் மட்டுமே செயல்படுகிறது.

source: Could not load {}
cs: Nepodařilo se načíst {}
ja: ファイル {} を読み込めません。
ta: ஏற்ற முடியவில்லை {}

source: Does this file exist? If it does, do you have permission to read it? Please check and try again.
cs: Existuje tento soubor? Pokud ano, máte práva na jeho čtení? Zkontrolujte ho, prosím, a zkuste to znovu.
ja: このファイルは存在しますか？ 存在していても読込み権限があるでしょうか？ 以上を確認して、再度試してみてください。
ta: இந்த கோப்பு இருக்கிறதா? அவ்வாறு செய்தால், அதைப் படிக்க உங்களுக்கு அனுமதி உள்ளதா? தயவுசெய்து சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

source: Is this a {} file?
cs: Je {} sobor?
ja: これは {} ファイルですか？
ta: இது ஒரு {} கோப்பா?

source: It looks like this could be a {} file. Would you like to change Mu to the {}mode?
cs: Zdá sa, že se jedná o soubor typu {}. Chcete přepnout Mu do režimu {}?
ja: これは {} ファイルのようです。 Mu を {} モードに変更しますか？
ta: இது ஒரு {} கோப்பாக இருக்கலாம் என்று தெரிகிறது. MU ஐ {} பயன்முறையில் மாற்ற விரும்புகிறீர்களா?

source: Could not save file (disk problem)
cs: Nepodařilo se uložit soubor (problém s diskem)
ja: ファイルを保存できませんでした(ディスクの問題)。
ta: கோப்பைச் சேமிக்க முடியவில்லை (வட்டு சிக்கல்)

source: Error saving file to disk. Ensure you have permission to write the file and sufficient disk space.
cs: Během ukládání souboru na disk došlo k chybě. Ujistěte se, že máte právo zápisu souboru a dostatek místa na disku.
ja: ディスクへのファイルの保存でエラーになりました。ファイルの書込み権とディスクの空きが十分にあるかを確認してください。
ta: வட்டில் கோப்பைச் சேமிப்பது பிழை. கோப்பு மற்றும் போதுமான வட்டு இடத்தை எழுத உங்களுக்கு அனுமதி இருப்பதை உறுதிசெய்க.

source: Could not save file (encoding problem)
cs: Nepodařilo se uložit soubor (problém s kódováním)
ja: ファイルを保存できませんでした(エンコーディングの問題)。
ta: கோப்பைச் சேமிக்க முடியவில்லை (குறியாக்க சிக்கல்)

source: Unable to convert all the characters. If you have an encoding line at the top of the file, remove it and try again.
cs: Není možné konvertovat všetky znaky. Pokud máte v prvním řádku souboru uvedené kódování, odstraňte ho a zkuste to znova.
ja: すべての文字を変換できませんでした。ファイルの先頭にエンコーディング行がある場合は、それを削除してもう一度やり直してください。
ta: எல்லா கதாபாத்திரங்களையும் மாற்ற முடியவில்லை. கோப்பின் மேற்புறத்தில் உங்களிடம் ஒரு குறியாக்க வரி இருந்தால், அதை அகற்றி மீண்டும் முயற்சிக்கவும்.

source: Saved file: {}
cs: Uložený soubor: {}
ja: 保存したファイル: {}
ta: சேமித்த கோப்பு: {}

source: You cannot use the filename "{}"
cs: Nemůžete použít "{}" jako název souboru
ja: ファイル名 "{}" は使えません
ta: "{}" என்ற கோப்பு பெயரை நீங்கள் பயன்படுத்த முடியாது

source: This name is already used by another part of Python. If you use this name, things are likely to break. Please try again with a different filename.
cs: Tento název už používá jiná část jazyka Python. Pokud ho použijete, je velmi pravděpodobné, že se některé věci pokazí. Zkuste to, prosím, znovu s jiným názvem souboru.
ja: この名前はすでに Python の別のところで使われています。この名前を使うと Python のシステムを壊してしまう可能性があります。別のファイル名でもう一度やり直してください。
ta: இந்த பெயர் ஏற்கனவே பைத்தானின் மற்றொரு பகுதியால் பயன்படுத்தப்படுகிறது. நீங்கள் இந்த பெயரைப் பயன்படுத்தினால், விஷயங்கள் உடைந்து போக வாய்ப்புள்ளது. வேறு கோப்பு பெயருடன் மீண்டும் முயற்சிக்கவும்.

source: Good job! No problems found.
cs: Dobrá práce! Nenašly se žádné problémy.
ja: よくできました！ 問題は見つかりませんでした。
ta: நல்ல வேலை! எந்த பிரச்சனையும் கிடைக்கவில்லை.

source: Hurrah! Checker turned up no problems.
cs: Hurá! Kontrola nehlásí žádné problémy.
ja: バンザイ！ チェッカは問題を検出しませんでした。
ta: அவசரம்! செக்கர் எந்த பிரச்சனையும் இல்லை.

source: Nice one! Zero problems detected.
cs: Pěkně! Nebyl zjištěný žádný problém.
ja: 良いですね！ 問題の検出はゼロです。
ta: அழகான ஒன்று! பூஜ்ஜிய சிக்கல்கள் கண்டறியப்பட்டன.

source: Well done! No problems here.
cs: Výborně! Bez problémov.
ja: よくやりました！ 問題ありません。
ta: நல்லது! இங்கே எந்த பிரச்சனையும் இல்லை.

source: Awesome! Zero problems found.
cs: Úžasné! Nula nálezených problémů.
ja: 驚ろきました！ 問題は何も見つかりません。
ta: அருமை! பூஜ்ஜிய சிக்கல்கள் காணப்பட்டன.

source: There is un-saved work, exiting the application will cause you to lose it.
cs: Vaše práce není uložená. Ukončením aplikace ji ztratíte.
ja: 保存していないスクリプトがありますが、アプリケーションを終了すると消えてしまいます。
ta: சேமிக்கப்படாத வேலை உள்ளது, பயன்பாட்டிலிருந்து வெளியேறுவது அதை இழக்க நேரிடும்.

source: Could not find MicroPython runtime.
cs: Nepodařilo se najít runtime pro MicroPython.
ja: MicroPython ランタイムが見つかりません。
ta: மைக்ரோபிதான் இயக்க நேரத்தைக் கண்டுபிடிக்க முடியவில்லை.

source: The micro:bit runtime you specified ('{}') does not exist. Please try again.
cs: Runtime pre micro:bit, který jste specifikovali ('{}'), neexistuje. Zkuste to, prosím, znovu.
ja: 指定した micro:bit ランタイムは存在しません。もう一度やり直してください。
ta: மைக்ரோ: நீங்கள் குறிப்பிட்ட பிட் இயக்க நேரம் ('{}') இல்லை. தயவு செய்து மீண்டும் முயற்சிக்கவும்.

source: Changed to {} mode.
cs: Režim se změnil na {}.
ja: モードを {} に変更します。
ta: {} பயன்முறையாக மாற்றப்பட்டது.

source: Detected new {} device.
cs: Bylo rozpoznané nové zařízení {}.
ja: 新規の {} デバイスを検出しました。
ta: புதிய}} சாதனம் கண்டறியப்பட்டது.

source: Would you like to change Mu to the {} mode?
cs: Chcete změnit režim Mu na {}?
ja: Mu を {} モードに変更しますか？
ta: MU ஐ {} பயன்முறையில் மாற்ற விரும்புகிறீர்களா?

source: Cannot Set Breakpoint.
cs: Není možné nastavit bod přerušení.
ja: ブレイクポイントを設定できません。
ta: பிரேக் பாயிண்ட் அமைக்க முடியாது.

source: Lines that are comments or some multi-line statements cannot have breakpoints.
cs: Řádky, které jsou komentáři, anebo některé víceřádkové příkazy nemhou mít bod přerušení.
ja: コメント行や複数行のステートメントの一部はブレイクポイントに設定できません。
ta: கருத்துகள் அல்லது சில மல்டி-லைன் அறிக்கைகள் கொண்ட வரிகள் முறிவு புள்ளிகளைக் கொண்டிருக்க முடியாது.

source: This name is already used by another part of Python. If you use that name, things are likely to break. Please try again with a different filename.
cs: Tento název už používá jiná část jazyka Python. Pokud ho použijete, je velmi pravděpodobné, že se některé věci pokazí. Zkuste to, prosím, znovu s jiným názvem souboru.
ja: この名前はすでに Python の別のところで使われています。この名前を使うと Python のシステムを壊してしまう可能性があります。別のファイル名でもう一度やり直してください。
ta: இந்த பெயர் ஏற்கனவே பைத்தானின் மற்றொரு பகுதியால் பயன்படுத்தப்படுகிறது. நீங்கள் அந்த பெயரைப் பயன்படுத்தினால், விஷயங்கள் உடைந்து போக வாய்ப்புள்ளது. வேறு கோப்பு பெயருடன் மீண்டும் முயற்சிக்கவும்.

source: Could not rename file.
cs: Soubor se nepodařilo přejmenovat.
ja: ファイル名を変更できませんでした。
ta: கோப்பை மறுபெயரிட முடியவில்லை.

source: A file of that name is already open in Mu.
cs: Soubor tohot jména je v Mu už otevřený.
ja: この名前のファイルは Mu で既に開いています。
ta: அந்த பெயரின் கோப்பு ஏற்கனவே MU இல் திறக்கப்பட்டுள்ளது.

source: Replaced "{}" with "{}".
cs: Řetězec "{}" nahrazen řetězcem "{}".
ja: "{}" を "{}" で置換する。
ta: "{}" ஐ "{}" உடன் மாற்றியது.

source: Replaced {} matches of "{}" with "{}".
cs: {} shod řetězce "{}" nahrazeno řetězcem "{}".
ja: {} 個の "{}" を "{}" で置換しました。
ta: "{}" இன் {} "உடன்" {} "உடன் மாற்றப்பட்டது.

source: Could not find "{}".
cs: Nepodařilo se najít "{}".
ja: "{}" が見つかりませんでした。
ta: கண்டுபிடிக்க முடியவில்லை "{}".

source: Highlighting matches for "{}".
cs: Zvýrazňují se shody pro řetězec "{}".
ja: 検索した "{}" を強調表示しました。
ta: "{}" க்கான போட்டிகளை முன்னிலைப்படுத்துகிறது.

source: You must provide something to find.
cs: Pro vyhledávání musíte něco zadat.
ja: 検索するものを指定してください。
ta: நீங்கள் கண்டுபிடிக்க ஏதாவது வழங்க வேண்டும்.

source: Please try again, this time with something in the find box.
cs: Zkuste to, prosím, znovu, tentokrát ale s něčím v poli pro vyhledávání.
ja: 今度は検索ボックスに何かを入れて、もう一度お試しください。
ta: தயவுசெய்து மீண்டும் முயற்சிக்கவும், இந்த முறை கண்டுபிடி பெட்டியில் ஏதேனும் ஒன்றைக் கொண்டு.

source: Use CircuitPython on Adafruit's line of boards.
ja: Adafruit がサポートするボードの CircuitPython を使います。

source: Serial
cs: Sériová linka
ja: シリアル
ta: தொடர்

source: Open a serial connection to your device.
cs: Otevře spojení přes sériovou linku s vaším zařízením.
ja: デバイスへのシリアル接続を開きます。
ta: உங்கள் சாதனத்திற்கு தொடர் இணைப்பைத் திறக்கவும்.

source: Plotter
cs: Plotr
ja: プロッター
ta: சதித்திட்டம்

source: Plot incoming REPL data.
cs: Vypíše příchozí údaje z REPL.
ja: REPL 入力のデータをプロットします。
ta: சதி உள்வரும் REPL தரவு.

source: Could not find an attached Adafruit CircuitPython device.
ja: CircuitPython デバイスが繋げられていないようです。

source: Python files for Adafruit CircuitPython devices are stored on the device. Therefore, to edit these files you need to have the device plugged in. Until you plug in a device, Mu will use the directory found here: {} ...to store your code.
ja: Adafruit CircuitPython デバイスの Python ファイルはデバイス内に保存するので、デバイスが接続されている必要があります。デバイスを接続するまで、Mu はコードを保存するために次のディレクトリを使います: {}

source: Data Flood Detected!
cs: Byla zjištěná záplava daty!
ja: データの氾濫を検出しました！
ta: தரவு வெள்ளம் கண்டறியப்பட்டது!

source: The plotter is flooded with data which will make Mu unresponsive and freeze. As a safeguard, the plotter has been stopped. Flooding is when chunks of data of more than 1024 bytes are repeatedly sent to the plotter. To fix this, make sure your code prints small tuples of data between calls to 'sleep' for a very short period of time.
cs: Zapisovač je zaplavený daty, což způsobuje, že Mu přestane reagovat a zamrzne. Proto byl z bezpečnostních důvodů zapisovač zastavený. K záplavě dochází v případě, když se do zapisovače opakovaně odesílají části údajů s velikostí větší než 1024 bytů. Pokud chcete tento problém odstranit, ujistěte se, že váš kód vypisuje malé n-tice údajů mezi voláními funkce na uspání na velmi krátký čas.
ja: Mu が無反応でフリーズしてしまうぐらいのデータが溢れています。セーフガードとしてプロッタを停止させました。 溢れているとは、1024バイトを超えるデータセットがプロッターに繰り返し送信されている状態です。 これを解決するには、非常に短時間の 'sleep' 呼び出しの合間にデータの小さなタプルをプリントするようにしてください。
ta: எம்.யூ.க்கு பதிலளிக்காத மற்றும் முடக்கம் செய்யும் தரவுகளால் சதித்திட்டம் வெள்ளத்தில் மூழ்கியுள்ளது. ஒரு பாதுகாப்பாக, சதித்திட்டம் நிறுத்தப்பட்டுள்ளது. 1024 க்கும் மேற்பட்ட பைட்டுகளின் தரவுகளின் துகள்கள் மீண்டும் மீண்டும் சதித்திட்டத்திற்கு அனுப்பப்படும் போது வெள்ளம் ஆகும். இதை சரிசெய்ய, உங்கள் குறியீடு மிகக் குறுகிய காலத்திற்கு 'தூக்கத்திற்கு' அழைப்புகளுக்கு இடையிலான சிறிய தரவை அச்சிடுவதை உறுதிசெய்க.

source: Click on the device's reset button, wait a few seconds and then try again.
cs: Zmáčkněte tlačítko reset na vašem zařízení, počkejte pár sekund a zkuste to znovu.
ja: デバイスのリセットボタンを押して数秒待った後に再度試してください。
ta: சாதனத்தின் மீட்டமைப்பு பொத்தானைக் கிளிக் செய்து, சில வினாடிகள் காத்திருந்து மீண்டும் முயற்சிக்கவும்.

source: Could not find an attached device.
cs: Nepodařilo se najít připojené zařízení.
ja: デバイスが繋げられていないようです。
ta: இணைக்கப்பட்ட சாதனத்தைக் கண்டுபிடிக்க முடியவில்லை.

source: Please make sure the device is plugged into this computer. It must have a version of MicroPython (or CircuitPython) flashed onto it before the REPL will work. Finally, press the device's reset button and wait a few seconds before trying again.
cs: Ujistěte se, prosím, že je zařízení připojené k tomuto počítači. Předtím, než bude REPL fungovat, musí být na zařízení zapsaný MicroPython (alebo CircuitPython). Nakonec zmáčkněte na zařízení tlačítko reset, počkejte několik sekund a zkuste to znovu.
ja: デバイスがこのコンピュータに繋げられているかを確認してください。 REPL が動作するには、MicroPython (または CircuitPython)がデバイスに転送されている必要があります。 最後に、デバイスのリセットボタンを押してから、もう一度試してください。
ta: இந்த கணினியில் சாதனம் செருகப்பட்டிருப்பதை உறுதிப்படுத்தவும். ரெப் வேலை செய்வதற்கு முன்பு இது மைக்ரோபிதான் (அல்லது சர்க்யூட்ட்பிதான்) பதிப்பைக் கொண்டிருக்க வேண்டும். இறுதியாக, சாதனத்தின் மீட்டமைப்பு பொத்தானை அழுத்தி, மீண்டும் முயற்சிக்கும் முன் சில வினாடிகள் காத்திருங்கள்.

source: Please make sure the device is plugged into this computer. It must have a version of MicroPython (or CircuitPython) flashed onto it before the Plotter will work. Finally, press the device's reset button and wait a few seconds before trying again.
cs: Ujistěte se, prosím, že je zařízení připojené k tomuto počítači. Předtím, než bude plotr fungovat, musí být na zařízení zapsaný MicroPython (alebo CircuitPython). Nakonec zmáčkněte na zařízení tlačítko reset, počkejte několik sekund a zkuste to znovu.
ja: デバイスがこのコンピュータに繋げられているかを確認してください。 プロッターが動作するには、MicroPython (または CircuitPython)がデバイスに転送されている必要があります。 最後に、デバイスのリセットボタンを押してから、もう一度試してください。
ta: இந்த கணினியில் சாதனம் செருகப்பட்டிருப்பதை உறுதிப்படுத்தவும். இது சதிகாரர் வேலை செய்வதற்கு முன்பு மைக்ரோபிதான் (அல்லது சர்க்யூட்டிபிதான்) பதிப்பைக் கொண்டிருக்க வேண்டும். இறுதியாக, சாதனத்தின் மீட்டமைப்பு பொத்தானை அழுத்தி, மீண்டும் முயற்சிக்கும் முன் சில வினாடிகள் காத்திருங்கள்.

source: Graphical Debugger
cs: Grafické ladění
ja: グラフィカルデバッガ
ta: வரைகலை பிழைத்திருத்தம்

source: Debug your Python 3 code.
cs: Ladit váš Python 3 kód.
ja: Python 3 コードをデバッグします。
ta: உங்கள் பைதான் 3 குறியீட்டை பிழைத்திருத்தல்.

source: Stop
cs: Zastavit
ja: 停止
ta: நிறுத்து

source: Stop the running code.
cs: Zastaví spuštěný kód.
ja: コードの実行を停止します。
ta: இயங்கும் குறியீட்டை நிறுத்துங்கள்.

source: Continue
cs: Pokračovat
ja: 継続
ta: தொடரவும்

source: Continue to run your Python script.
cs: Pokračovat ve vašem Python skriptu.
ja: Python スクリプトの実行を継続します。
ta: உங்கள் பைதான் ஸ்கிரிப்டை இயக்கவும்.

source: Step Over
ja: ステップオーバー
ta: படி

source: Step over a line of code.
ja: コードの１行をステップオーバーします。
ta: குறியீட்டின் வரிசையில் அடியெடுத்து வைக்கவும்.

source: Step In
cs: Vsoupit
ja: ステップイン
ta: உள்ளே வா

source: Step into a function.
cs: Vstoupí do funkcie.
ja: 関数にステップインします。
ta: ஒரு செயல்பாட்டில் அடியெடுத்து வைக்கவும்.

source: Step Out
cs: Vystopit
ja: ステップアウト
ta: வெளியே செல்லுங்கள்

source: Step out of a function.
cs: Vystopí z funkce.
ja: 関数からステップアウトします。
ta: ஒரு செயல்பாட்டிலிருந்து வெளியேறவும்.

source: Your script has finished running.
cs: Váš skriptu doběhl do konce.
ja: スクリプトの実行を終了しました。
ta: உங்கள் ஸ்கிரிப்ட் இயங்குவதை முடித்துவிட்டது.

source: Unable to connect to the Python debugger.
cs: Nepodařilo se připojit k ladicímu programu jazyka Python.
ja: Python デバッガに接続できません。
ta: பைதான் பிழைத்திருத்தியுடன் இணைக்க முடியவில்லை.

source: Debugger info: {}
cs: Info ladicího programu: {}
ja: デバッガ情報: {}
ta: பிழைத்திருத்த தகவல்: {}

source: Debugger warning: {}
cs: Varování ladicího progamu: {}
ja: デバッガ警告: {}
ta: பிழைத்திருத்த எச்சரிக்கை: {}

source: Debugger error: {}
cs: Chyba ladicího programu: {}
ja: デバッガエラー: {}
ta: பிழைத்திருத்த பிழை: {}

source: Write MicroPython for the BBC micro:bit.
cs: Programujte BBC micro:bit v jazyku MicroPython.
ja: BBC micro:bit の MicroPython を編集。
ta: பிபிசி மைக்ரோவுக்கு மைக்ரோபிதான் எழுதுங்கள்: பிட்.

source: Flash
cs: Zapsat
ja: 転送
ta: ஃபிளாஷ்

source: Flash your code onto the micro:bit.
cs: Zapíše váš kód na micro:bit.
ja: コードを micro:bit に転送します。
ta: உங்கள் குறியீட்டை மைக்ரோ: பிட் மீது ஒளிரச் செய்யுங்கள்.

source: Files
cs: Soubory
ja: ファイル
ta: கோப்புகள்

source: Access the file system on the micro:bit.
cs: Přístup k souborovému systému na zařízení micro:bit.
ja: micro:bit にあるファイルにアクセスします。
ta: மைக்ரோ: பிட் இல் கோப்பு முறைமையை அணுகவும்.

source: Use the REPL to live-code on the micro:bit.
cs: Spustí živé programování (REPL) na zařízení micro:bit.
ja: micro:bit を対話モードで利用します。
ta: மைக்ரோ: பிட் மீது நேரடி குறியீட்டிற்கு REPR ஐப் பயன்படுத்தவும்.

source: Unable to flash "{}"
cs: Nedá se zapsat "{}"
ja: "{}" を転送できません

source: Problem with script
ja: スクリプトに問題があります

source: Our minifier tried but your script is too long!
cs: Náš minifikátor to zkusil, ale váš skript je i tak příliš dlouhý!
ja: 縮小しようとしましたが、スクリプトが長すぎます！
ta: எங்கள் குறைத்தல் முயற்சித்தது, ஆனால் உங்கள் ஸ்கிரிப்ட் மிக நீளமானது!

source: Your script is too long and the minifier isn't available
cs: Váš skript je příliš dlouhý a minifikátor kódu není dostupný
ja: スクリプトが長すぎて縮小できません
ta: உங்கள் ஸ்கிரிப்ட் மிக நீளமானது மற்றும் மினிஃபயர் கிடைக்கவில்லை

source: Your script is too long!
ja: スクリプトが長すぎます！

source: Flashing "{}" onto the micro:bit.
ja: micro:bit に "{}" を転送中。

source: Runtime: {}
ja: ランタイム: {}

source: Unsupported BBC micro:bit.
cs: Nepodporovaný BBC micro:bit.
ja: 未サポートの BBC micro:bit。
ta: ஆதரிக்கப்படாத பிபிசி மைக்ரோ: பிட்.

source: Your device is newer than this version of Mu. Please update Mu to the latest version to support this device. https://codewith.mu/
cs: Vaše zařízení je novější než tato verze Mu. Aktualizujte, prosím, Mu na nejnovější verzi, aby podporovala toto zařízení. https://codewith.mu/
ja: デバイスがこの Mu のバージョンで扱うには新しすぎます。このデバイスをサポートするために Mu を最新バージョンにアップデートしてください。 https://codewith.mu/
ta: MU இன் இந்த பதிப்பை விட உங்கள் சாதனம் புதியது. இந்த சாதனத்தை ஆதரிக்க MU ஐ சமீபத்திய பதிப்பிற்கு புதுப்பிக்கவும். https://codewith.mu/

source: Could not find an attached BBC micro:bit.
cs: Nepodařilo se najít připojený BBC micro:bit.
ja: BBC micro:bit が繋げられていないようです
ta: இணைக்கப்பட்ட பிபிசி மைக்ரோ: பிட் கண்டுபிடிக்க முடியவில்லை.

source: Please ensure you leave enough time for the BBC micro:bit to be attached and configured correctly by your computer. This may take several seconds. Alternatively, try removing and re-attaching the device or saving your work and restarting Mu if the device remains unfound.
cs: Ujistěte se, prosím, že jste si nechali dostatek času na připojení a správné nastavení zařízení BBC micro:bit vaším počítačem. Může to trvat několik sekund. Případně se pokuste zařízení znovu odpojit a pripojit anebo uložte svoji práci a restartujte Mu, pokud sa zařízení i tak nenašlo.
ja: BBC micro:bit を正しく繋げている場合でも、コンピュータがそれを認識するのに十分な時間をおいてください。これには数秒かかることがあります。それでもデバイスが認識されない場合は、デバイス一度取り外して再度繋げるか、スクリプトを保存して Mu を再起動してみてください。
ta: பிபிசி மைக்ரோவுக்கு போதுமான நேரத்தை விட்டுவிடுவதை உறுதிசெய்க: பிட் உங்கள் கணினியால் சரியாக இணைக்கப்பட்டு சரியாக உள்ளமைக்கப்பட வேண்டும். இதற்கு பல வினாடிகள் ஆகலாம். மாற்றாக, சாதனம் ஆதாரமற்றதாக இருந்தால் சாதனத்தை அகற்றி மீண்டும் இணைக்க முயற்சிக்கவும் அல்லது உங்கள் வேலையைச் சேமிக்கவும், MU ஐ மறுதொடக்கம் செய்யவும் முயற்சிக்கவும்.

source: Finished flashing.
cs: Zapisování doběhlo.
ja: 転送を完了しました。
ta: ஒளிரும் முடிந்தது.

source: Copied code onto micro:bit.
ja: micro:bit にコードをコピーしました。
ta: குறியீட்டை மைக்ரோ மீது நகலெடுத்தது: பிட்.

source: There was a problem flashing the micro:bit.
cs: Při zapisování na vývojovou desku micro:bit se vyskytl problém.
ja: micro:bit への転送で問題が発生しました。
ta: மைக்ரோ: பிட் ஒளிரும் சிக்கல் இருந்தது.

source: Please do not disconnect the device until flashing has completed. Please check the logs for more information.
cs: Neodpojujte, prosím, zařízení, dokud není dokončené zapisování. Další informace najdete v záznamníku.
ja: 転送が完了するまでデバイスを取り外さないでください。詳しくは Mu のログを確認してください。
ta: ஒளிரும் வரை சாதனத்தைத் துண்டிக்க வேண்டாம். மேலும் தகவலுக்கு பதிவுகளை சரிபார்க்கவும்.

source: REPL and file system cannot work at the same time.
cs: REPL a souborový systém nemohou pracovat současně.
ja: REPL とファイルシステムは同時に利用できません。
ta: REPL மற்றும் கோப்பு முறைமை ஒரே நேரத்தில் வேலை செய்ய முடியாது.

source: The REPL and file system both use the same USB serial connection. Only one can be active at any time. Toggle the file system off and try again.
cs: REPL spolu se souborovým systémem používají stejné sériové připojení přes USB. Jen jeden z nich může používat toto připojení. Vypněte souborový systém a zkuste to znovu.
ja: REPL とファイルシステムはどちらも USB シリアル接続を利用しますが、有効にできるのは常にどちらか一方です。ファイルシステムの利用を止めて、もう一度試してください。
ta: REPL மற்றும் கோப்பு முறைமை இரண்டும் ஒரே யூ.எஸ்.பி தொடர் இணைப்பைப் பயன்படுத்துகின்றன. ஒருவர் மட்டுமே எந்த நேரத்திலும் செயலில் இருக்க முடியும். கோப்பு முறைமையை மாற்றி மீண்டும் முயற்சிக்கவும்.

source: The plotter and file system cannot work at the same time.
cs: Plotr a soborový systém nemohou pracovat sočasne.
ja: プロッターとファイルシステムは同時に利用できません。
ta: சதித்திட்டம் மற்றும் கோப்பு முறைமை ஒரே நேரத்தில் வேலை செய்ய முடியாது.

source: The plotter and file system both use the same USB serial connection. Only one can be active at any time. Toggle the file system off and try again.
cs: Plotr spolu se souborovým systémem používají stejné sériové připojení přes USB. Jen jeden z nich může používat toto připojení. Vypněte souborový systém a zkuste to znovu.
ja: プロッターとファイルシステムはどちらも USB シリアル接続を利用しますが、有効にできるのは常にどちらか一方です。ファイルシステムの利用を止めて、もう一度試してください。
ta: சதித்திட்டம் மற்றும் கோப்பு முறைமை இரண்டும் ஒரே யூ.எஸ்.பி தொடர் இணைப்பைப் பயன்படுத்துகின்றன. ஒருவர் மட்டுமே எந்த நேரத்திலும் செயலில் இருக்க முடியும். கோப்பு முறைமையை மாற்றி மீண்டும் முயற்சிக்கவும்.

source: File system cannot work at the same time as the REPL or plotter.
cs: Souborový systém nemôže pracovať současně s REPL anebo plotrem.
ja: ファイルシステムは REPL やプロッターと同時に利用できません。
ta: கோப்பு முறைமை REPL அல்லது சதித்திட்டத்தின் அதே நேரத்தில் வேலை செய்ய முடியாது.

source: The file system and the REPL and plotter use the same USB serial connection. Toggle the REPL and plotter off and try again.
cs: Souborový systém, REPL a plotr používají stejné sériové připojení přes USB. Vypněte REPL a zapisovač a zkuste to znovu.
ja: ファイルシステムと REPL とプロッターは同じ USB シリアル接続を利用します。REPL とプロッターの利用を止めて、再度試してください。
ta: கோப்பு முறைமை மற்றும் REPL மற்றும் சதித்திட்டம் ஒரே யூ.எஸ்.பி தொடர் இணைப்பைப் பயன்படுத்துகின்றன. REPL மற்றும் சதித்திட்டத்தை மாற்றி மீண்டும் முயற்சிக்கவும்.

source: Please make sure the device is plugged into this computer. The device must have MicroPython flashed onto it before the file system will work. Finally, press the device's reset button and wait a few seconds before trying again.
cs: Ujistěte se, prosím, že je zařízení připojené k počítači. Aby souborový systém fungoval, musí být na zařízení zapsaný MicroPython. Nakoniec zmáčkněte na zařízení tlačítko reset a před dalším pokusem počkejte několik sekund.
ja: デバイスがこのコンピュータに繋げられているかを確認してください。 ファイルシステムが動作するには、MicroPython がデバイスに転送されている必要があります。 最後に、デバイスのリセットボタンを押してから、再度試してください。
ta: இந்த கணினியில் சாதனம் செருகப்பட்டிருப்பதை உறுதிப்படுத்தவும். கோப்பு முறைமை வேலை செய்வதற்கு முன்பு சாதனம் மைக்ரோபிதான் அதன் மீது பறக்க வேண்டும். இறுதியாக, சாதனத்தின் மீட்டமைப்பு பொத்தானை அழுத்தி, மீண்டும் முயற்சிக்கும் முன் சில வினாடிகள் காத்திருங்கள்.

source: Make games with Pygame Zero.
cs: Tvořte hry s knihovnou Pygame Zero.
ja: Pygame Zero でゲームを作成します。
ta: பைகேம் பூஜ்ஜியத்துடன் விளையாட்டுகளை உருவாக்குங்கள்.

source: Play
cs: Hrát
ja: プレイ
ta: விளையாடுங்கள்

source: Play your Pygame Zero game.
cs: Spustí vaši Pygame Zero hru.
ja: Pygame Zero ゲームをプレイします。
ta: உங்கள் பைகேம் பூஜ்ஜிய விளையாட்டை விளையாடுங்கள்.

source: Images
cs: Obrázky
ja: イメージ
ta: படங்கள்
