Repository: mu-editor/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: cs, ja, ta

source: pystubit.board.p3.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p3.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p3.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p3.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p3.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p3.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p3.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p3.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p3.status() Display current PWM usage on REPL.
ja: pystubit.board.p3.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p3.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p3.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p4.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p4.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p4.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p4.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p4.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p4.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p4.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p4.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p4.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p4.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p4.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p4.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p4.status() Display current PWM usage on REPL.
ja: pystubit.board.p4.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p5.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p5.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p5.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p5.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p5.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p5.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p5.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p5.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p5.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p5.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p5.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p5.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p5.status() Display current PWM usage on REPL.
ja: pystubit.board.p5.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p5.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p5.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p6.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p6.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p6.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p6.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p6.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p6.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p6.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p6.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p6.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p6.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p6.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p6.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p6.status() Display current PWM usage on REPL.
ja: pystubit.board.p6.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p7.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p7.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p7.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p7.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p7.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p7.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p7.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p7.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p7.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p7.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p7.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p7.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p7.status() Display current PWM usage on REPL.
ja: pystubit.board.p7.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p8.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p8.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p8.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p8.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p8.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p8.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p8.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p8.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p8.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p8.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p8.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p8.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p8.status() Display current PWM usage on REPL.
ja: pystubit.board.p8.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p8.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p8.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p9.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p9.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p9.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p9.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p9.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p9.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p9.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p9.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p9.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p9.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p9.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p9.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p9.status() Display current PWM usage on REPL.
ja: pystubit.board.p9.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p9.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p9.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p10.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p10.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p10.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p10.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p10.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p10.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p10.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p10.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p10.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p10.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p10.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p10.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p10.status() Display current PWM usage on REPL.
ja: pystubit.board.p10.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p11.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p11.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p11.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p11.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p11.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p11.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p11.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p11.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p11.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p11.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p11.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p11.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p11.status() Display current PWM usage on REPL.
ja: pystubit.board.p11.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p12.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p12.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p12.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p12.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p12.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p12.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p12.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p12.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p12.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p12.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p12.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p12.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p12.status() Display current PWM usage on REPL.
ja: pystubit.board.p12.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p13.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p13.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p13.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p13.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p13.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p13.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p13.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p13.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p13.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p13.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p13.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p13.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p13.status() Display current PWM usage on REPL.
ja: pystubit.board.p13.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p14.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p14.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p14.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p14.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p14.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p14.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p14.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p14.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p14.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p14.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p14.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p14.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p14.status() Display current PWM usage on REPL.
ja: pystubit.board.p14.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p15.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p15.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p15.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p15.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p15.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p15.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p15.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p15.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p15.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p15.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p15.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p15.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。
