Repository: mu-editor/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: cs, ja, ta

source: Show the images used by Pygame Zero.
cs: Zobrazí obrázky používané knihovnou Pygame Zero.
ja: Pygame で使うイメージを表示します。
ta: பைகேம் ஜீரோ பயன்படுத்தும் படங்களைக் காட்டு.

source: Fonts
cs: Písma
ja: フォント
ta: எழுத்துருக்கள்

source: Show the fonts used by Pygame Zero.
cs: Zobrazí písma používaná knihovnou Pygame Zero.
ja: Pygame Zero で使うフォントを表示します。
ta: பைகேம் ஜீரோ பயன்படுத்தும் எழுத்துருக்களைக் காட்டு.

source: Sounds
cs: Zvuky
ja: 効果音
ta: ஒலிகள்

source: Show the sounds used by Pygame Zero.
cs: Zobrazí zvuky používané knihovnou Pygame Zero.
ja: Pygame Zero で使う効果音を表示します。
ta: பைகேம் ஜீரோ பயன்படுத்தும் ஒலிகளைக் காட்டு.

source: Music
cs: Hudba
ja: 音楽
ta: இசை

source: Show the music used by Pygame Zero.
cs: Zobrazí hudbu používanou knihovnou Pygame Zero.
ja: Pygame Zero で使う音楽を表示します。
ta: பைகேம் ஜீரோ பயன்படுத்தும் இசையைக் காட்டு.

source: Stop your Pygame Zero game.
cs: Zastaví vaši Pygame Zero hru.
ja: Pygame Zero ゲームを停止します。
ta: உங்கள் பைகேம் பூஜ்ஜிய விளையாட்டை நிறுத்துங்கள்.

source: Create code using standard Python 3.
cs: Programujte pomocí standardního Pythonu 3.
ja: 標準 Python 3 のコードを作成します。
ta: நிலையான பைதான் 3 ஐப் பயன்படுத்தி குறியீட்டை உருவாக்கவும்.

source: Run
cs: Spustit
ja: 実行
ta: ஓடு

source: Run your Python script.
cs: Spustí váš skript v jazyku Python.
ja: Python スクリプトを実行します。
ta: உங்கள் பைதான் ஸ்கிரிப்டை இயக்கவும்.

source: Debug
cs: Ladit
ja: デバッグ
ta: பிழைத்திருத்தம்

source: Debug your Python script.
cs: Spustí ladění vašeho skriptu v jazyku Python.
ja: Python スクリプトをデバッグします。
ta: உங்கள் பைதான் ஸ்கிரிப்டை பிழைத்தேன்.

source: Use the REPL for live coding.
cs: Spustí REPL na živé programovanie.
ja: ライブコーディングのために REPL を利用します。
ta: நேரடி குறியீட்டுக்கு REPR ஐப் பயன்படுத்தவும்.

source: Plot data from your script or the REPL.
cs: Vykreslit data z vašeho skriptu anebo REPL.
ja: スクリプトまたは REPL からのデータをプロットします。
ta: உங்கள் ஸ்கிரிப்ட் அல்லது REPL இலிருந்து தரவை சதி செய்யுங்கள்.

source: Stop your Python script.
cs: Zastavit váš skript v jazyku Python.
ja: Python スクリプトを停止します。
ta: உங்கள் பைதான் ஸ்கிரிப்டை நிறுத்துங்கள்.

source: Starting iPython REPL.
cs: Spouští se iPython REPL.
ja: iPython REPL を始動します。
ta: Ipython repl ஐத் தொடங்குகிறது.

source: Stopping iPython REPL (this may take a short amount of time).
cs: Zastavuje se iPython REPL (může to chvíli trvat).
ja: iPython REPL を停止(少し時間がかかります)。
ta: ஐபிதான் ரெப்பை நிறுத்துவது (இதற்கு குறுகிய நேரம் ஆகலாம்).

source: REPL started.
cs: REPL se spustil.
ja: REPL が始動しました。
ta: REPL தொடங்கியது.

source: REPL stopped.
cs: REPL se zastavil.
ja: REPL が停止しました。
ta: REPLR நிறுத்தப்பட்டது.

source: Files on your device:
cs: Soubory na vašem zařízení:
ja: デバイス のファイル:
ta: உங்கள் சாதனத்தில் உள்ள கோப்புகள்:

source: pystubit.board.button_a.is_pressed() If button A is pressed down, is_pressed() is True, else False.
ja: pystubit.board.button_a.is_pressed() ボタンAが押されている場合はTrue、そうでない場合はFalseを返します。

source: pystubit.board.button_a.was_pressed() Use was_pressed() to learn if button A was pressed since the last time was_pressed() was called. Returns True or False, then resets the record.
ja: pystubit.board.button_a.was_pressed() ボタンAが過去に押されたかどうかを調べるのに使用します。 ボタンが押された場合はTrue、そうでない場合はFalseを返します。 本関数コール後、ボタンが押されたかどうかの情報はリセットされます。

source: pystubit.board.button_a.get_presses() Use get_presses() to get the running total of button presses, and also reset this counter to zero.
ja: pystubit.board.button_a.get_presses() ボタンAが過去に押された回数を調べるのに使用します。 本関数コール後、カウンタはリセットされます。

source: pystubit.board.button_a.get_value() If button A is pressed down, get_value() is 0, else 1.
ja: pystubit.board.button_a.get_value() ボタンAが押されている場合は0、そうでない場合は1を返します。

source: pystubit.board.button_b.is_pressed() If button B is pressed down, is_pressed() is True, else False.
ja: pystubit.board.button_b.is_pressed() ボタンBが押されている場合はTrue、そうでない場合はFalseを返します。

source: pystubit.board.button_b.was_pressed() Use was_pressed() to learn if button B was pressed since the last time was_pressed() was called. Returns True or False, then resets the record.
ja: pystubit.board.button_b.was_pressed() ボタンBが過去に押されたかどうかを調べるのに使用します。 ボタンが押された場合はTrue、そうでない場合はFalseを返します。 本関数コール後、ボタンが押されたかどうかの情報はリセットされます。

source: pystubit.board.button_b.get_presses() Use get_presses() to get the running total of button presses, and also reset this counter to zero.
ja: pystubit.board.button_b.get_presses() ボタンBが過去に押された回数を調べるのに使用します。 本関数コール後、カウンタはリセットされます。

source: pystubit.board.button_b.get_value() If button B is pressed down, get_value() is 0, else 1.
ja: pystubit.board.button_b.get_value() ボタンBが押されている場合は0、そうでない場合は1を返します。

source: pystubit.board.display.get_pixel(x, y) Use get_pixel(x, y) to return the display's color at LED pixel (x,y) in an (R, G, B) tuple. Returns values from (0, 0, 0) to (31, 31, 31).
ja: pystubit.board.display.get_pixel(x, y) LEDディスプレイの(x, y)にあるLEDの色を(R, G, B)のタプルで返します。 戻り値の型は(0, 0, 0)～(31, 31, 31)です。

source: pystubit.board.display.set_pixel(x, y, color) Use set_pixel(x, y, color) to set the display color at LED pixel (x,y). Use a tuple (R,G,B), list [R,G,B] or integer #RGB in 'color' to set the LED's color.
ja: pystubit.board.display.set_pixel(x, y, color) LEDディスプレイの(x, y)にあるLEDの色を'color'で設定します。 'color'は、タプル(R,G,B), リスト[R,G,B], 整数#RGBで指定できます。

source: pystubit.board.display.clear() Use clear() to clear the display.
ja: pystubit.board.display.clear() すべての LED の明るさを 0 (オフ)に設定します。

source: pystubit.board.display.show(x, delay=400, wait=True, loop=False, clear=False, color=None) Use show(x) to print a string or image to the display. If 'x' is a list of images they will be animated together. Use 'delay' to specify the speed of frame changes in milliseconds. If wait is False animation will happen in the background while the program continues. If loop is True the animation will repeat forever. If clear is True the display will clear at the end of the animation. Use a tuple (R,G,B), list [R,G,B] or integer #RGB in 'color' to set the image's color.
ja: pystubit.board.display.show(x, delay=400, wait=True, loop=False, clear=False, color=None) 文字列またはイメージ'x'をLEDディスプレイに表示する場合、show(x)と記述します。 'x'がイメージのリストの場合、イメージの表示が切り替わります（アニメーション）。 'delay'には、ミリ秒単位でフレームの表示時間の長さを設定します。 'wait'にFalseを設定した場合、バックグラウンドでアニメーション処理されます。 'loop'にTrueを設定した場合、アニメーションが無限に繰り返されます。 'clear'にTrueを設定した場合、アニメーション終了時にディスプレイをクリアします。 'color'には、ディスプレイに表示する色を設定します。タプル(R, G, B)、リスト[R, G, B]、整数#RGBのいずれかで設定します。

source: pystubit.board.display.scroll(string, delay=150, wait=True, loop=False, color=None) Use scroll(string) to scroll the string across the display. Use delay to control how fast the text scrolls. If wait is False the text will scroll in the background while the program continues. If loop is True the text will repeat forever. Use a tuple (R,G,B), list [R,G,B] or integer #RGB in 'color' to set the image's color.
ja: pystubit.board.display.scroll(string, delay=150, wait=True, loop=False, color=None) 文字列'string'をLEDディスプレイにスクロール表示する場合、scroll(string)と記述します。 'delay'には、文字のスクロールする速さを定義します。 'wait'にFalseを設定した場合、バックグラウンドでスクロール表示処理されます。 'loop'にTrueを設定した場合、スクロール表示が無限に繰り返されます。 'color'には、ディスプレイに表示する色を設定します。タプル(R, G, B)、リスト[R, G, B]、整数#RGBのいずれかで設定します。

source: pystubit.board.display.on() Turn on the display.
ja: pystubit.board.display.on() ディスプレイを有効にします。

source: pystubit.board.display.off() Turn off the display. (This allows GPIO used by the display to be used for other purposes.)
ja: pystubit.board.display.off() ディスプレイを無効にします。(ディスプレイに関連づけられた GPIO 端子を他の目的に再利用できるようになります)。

source: pystubit.board.display.is_on() Query if the display is on (True) or off (False).
ja: pystubit.board.display.is_on() ディスプレイが有効であれば True 、無効であれば False を返します。

source: pystubit.board.Image(string, color) Create and use built-in IMAGES to show on the display. Use: Image( '01100:' '10010:' '11110:' '10010:' '10010:', color=(0,10,0)) ...to make a new green heart image. Use 1s (ON) and 0s (OFF) in 'string' to set a pattern. Use a tuple (R,G,B), list [R,G,B] or integer #RGB in 'color' to set the image's color.
ja: pystubit.board.Image(string, color) LEDディスプレイで表示するイメージの作成や組み込みイメージを使用します。 Image('01100:10010:11110:10010:10010:', color=(0,10,0)) と記述することで緑色のハートのイメージを作成できます。 'string'には、'0':OFF, '1':ONでパターンを設定します。 'color'には、イメージの色を設定します。タプル(R, G, B)、リスト[R, G, B]、整数#RGBのいずれかで設定します。

source: pystubit.board.Image.width() Return the width of the image in pixels.
ja: pystubit.board.Image.width() イメージの幅をピクセルで返します。

source: pystubit.board.Image.height() Return the height of the image in pixels.
ja: pystubit.board.Image.height() イメージの高さをピクセルで返します。

source: pystubit.board.Image.set_pixel(x, y, value) Use set_pixel(x, y, value) to set the value of an LED pixel (x,y) in the image. It can be set to 0 (off) or 1 (on).
ja: pystubit.board.Image.set_pixel(x, y, value) イメージ(x,y)のピクセルを'value'で設定します。value引数は 0(OFF) / 1(ON)で指定します。

source: pystubit.board.Image.set_pixel_color(x, y, color) Use set_pixel_color(x, y, color) to set the LED pixel (x,y) in the image to a color which can be set using a tuple (R,G,B), list [R,G,B] or integer #RGB.
ja: pystubit.board.Image.set_pixel_color(x, y, color) イメージ(x,y)のピクセルの色を'color'で設定します。タプル(R, G, B)、リスト[R, G, B]、整数#RGBのいずれかで設定します。

source: pystubit.board.Image.get_pixel(x, y) Return 1 (on) or 0 (off) according to the state of the LED pixel (x,y) in the image.
ja: pystubit.board.Image.get_pixel(x, y) イメージ(x, y)のピクセルのON(1)/OFF(0)を返します。

source: pystubit.board.Image.get_pixel_color(x, y, hex=False) Use get_pixel_color(x, y, hex=False) to find the color of the LED pixel (x,y) in the image. Returns a color as a tuple (R,G,B) if hex is False, and as an integer #RGB if hex is True.
ja: pystubit.board.Image.get_pixel_color(x, y, hex=False) イメージ(x, y)のピクセルの色を返します。 'hex'にFalseを指定した場合タプル(R,G,B)を、Trueを指定した場合整数 #RGBを返します。

source: pystubit.board.Image.set_base_color(color) Use set_base_color(color) to set all LED pixels in the image to a color which can be set using a tuple (R,G,B), list [R,G,B] or integer #RGB.
ja: pystubit.board.Image.set_base_color(color) イメージの全ピクセルに設定する色を'color'で設定します。タプル(R, G, B)、リスト[R, G, B]、整数#RGBのいずれかで設定します。

source: pystubit.board.Image.shift_left(n) Use shift_left(n) to make a copy of the image but moved 'n' pixels to the left.
ja: pystubit.board.Image.shift_left(n) イメージをn列だけ左にシフトした新しいイメージを返します。

source: pystubit.board.Image.shift_right(n) Use shift_right(n) to make a copy of the image but moved 'n' pixels to the right.
ja: pystubit.board.Image.shift_right(n) イメージをn列だけ右にシフトした新しいイメージを返します。

source: pystubit.board.Image.shift_up(n) Use shift_up(n) to make a copy of the image but moved 'n' pixels up.
ja: pystubit.board.Image.shift_up(n) イメージをn行だけ上にシフトした新しいイメージを返します。

source: pystubit.board.Image.shift_down(n) Use shift_down(n) to make a copy of the image but moved 'n' pixels down.
ja: pystubit.board.Image.shift_down(n) イメージをn行だけ下にシフトした新しいイメージを返します。

source: pystubit.board.Image.copy() Use copy() to make a new exact copy of the image.
ja: pystubit.board.Image.copy() イメージのコピーを返します。

source: pystubit.board.buzzer.on(sound, duration=-1) Play sound from the Buzzer at a pitch specified in 'sound'. 'sound' can be set using strings ('C3'-'G9'), MIDI note numbers ('48'-'127') or frequencies (in integers). Use 'duration' to set the duration of the sound in milliseconds.
ja: pystubit.board.buzzer.on(sound, duration=-1) ブザーから'sound'で指定された高さの音を出力します。 'sound'には、文字列で'C3'～'G9'のコード、'48'～'127'のMIDIノートナンバー、整数で周波数を設定します。 'duration'には、音を出力する時間をミリ秒単位で設定します。

source: pystubit.board.buzzer.off() Stop any current sound output.
ja: pystubit.board.buzzer.off() 音が出力されている場合、停止します。

source: pystubit.board.temperature.get_value() Return Studuino:bit's temperature value(0-4095) in degrees Linear.
ja: pystubit.board.temperature.get_value() 基板上の温度センサーの値（0-4095）を返します。

source: pystubit.board.temperature.get_celsius() Return Studuino:bit's temperature in degrees Celcius.
ja: pystubit.board.temperature.get_celsius() 基板上の温度センサーの値を温度（セ氏）を返します。

source: pystubit.board.lightsensor.get_value() Return Studuino:bit's light sensor's value(0-4095) in linear.
ja: pystubit.board.lightsensor.get_value() 基板上の光センサーの値（0-4095）を返します。

source: pystubit.board.accelerometer.get_x() Return Studuino:bit's tilt (X acceleration) in m/s/s's.
ja: pystubit.board.accelerometer.get_x() 基板の傾き（X軸の加速度）を返します。戻り値の型は符号付小数点、デフォルトの単位はメートル/秒/秒です。

source: pystubit.board.accelerometer.get_y() Return Studuino:bit's tilt (Y acceleration) in m/s/s's.
ja: pystubit.board.accelerometer.get_y() 基板の傾き（Y軸の加速度）を返します。戻り値の型は符号付小数点、デフォルトの単位はメートル/秒/秒です。

source: pystubit.board.accelerometer.get_z() Return Studuino:bit's tilt (Z acceleration) in m/s/s's.
ja: pystubit.board.accelerometer.get_z() 基板の傾き（Z軸の加速度）を返します。戻り値の型は符号付小数点、デフォルトの単位はメートル/秒/秒です。

source: pystubit.board.accelerometer.get_values() Get the acceleration measurements in all axes at once, as a three-element tuple of integers (ordered as X, Y, Z).
ja: pystubit.board.accelerometer.get_values() X,Y,Z軸の加速度をタプルで返します。(get_x(), get_y(), get_z())。

source: pystubit.board.accelerometer.set_fs(value) Set the sensor's maximum measurement. Use the string '2g', '4g', '8g', or '16g' to set the maximum value between 2G and 16G.
ja: pystubit.board.accelerometer.set_fs(value) センサーのフルスケールを設定します。 2G～16Gまで計測可能で、value引数には、文字列で'2g'/'4g'/'8g'/'16g'を設定します。

source: pystubit.board.accelerometer.set_sf(value) Set the sensor's units of measurement. It can be set to 'mg' (mg units) or 'ms2' (m/s/s units).
ja: pystubit.board.accelerometer.set_sf(value) センサーのスケールファクタを設定します。 ミリGまたはメートル/秒/秒の単位が指定できます。value引数には、文字列で'mg'/'ms2'を設定します。

source: pystubit.board.gyro.get_x() Return Studuino:bit's angular velocity on the X-axis in m/s/s's.
ja: pystubit.board.gyro.get_x() X軸の角速度を返します。戻り値の型は符号付小数点、デフォルトの単位は角度/秒です。

source: pystubit.board.gyro.get_y() Return Studuino:bit's angular velocity on the Y-axis in m/s/s's.
ja: pystubit.board.gyro.get_y() Y軸の角速度を返します。戻り値の型は符号付小数点、デフォルトの単位は角度/秒です。

source: pystubit.board.gyro.get_z() Return Studuino:bit's angular velocity on the Z-axis in m/s/s's.
ja: pystubit.board.gyro.get_z() Z軸の角速度を返します。戻り値の型は符号付小数点、デフォルトの単位は角度/秒です。

source: pystubit.board.gyro.get_values() Get the angular velocity in all axes at once, as a three-element tuple of integers (ordered as X, Y, Z).
ja: pystubit.board.gyro.get_values() X,Y,Z軸の角速度をタプルで返します。(get_x(), get_y(), get_z())。

source: pystubit.board.gyro.set_fs(value) Set the sensor's maximum measurement. Use the string '250dps', '500dps', '1000dps', or '2000dps' to set the maximum value between 250 and 2000 degrees per second.
ja: pystubit.board.gyro.set_fs(value) センサーのフルスケールを設定します。 250度/秒～2000度/秒まで計測可能で、value引数には、文字列で'250dps'/'500dps'/'1000dps'/'2000dps'を設定します。

source: pystubit.board.gyro.set_sf(value) Set the sensor's units of measurement. It can be set to 'dps' (degrees per second) or 'rps' (radians per second).
ja: pystubit.board.gyro.set_sf(value) センサーのスケールファクタを設定します。 角度/秒またはラジアン/秒の単位が指定できます。value引数には、文字列で'dps'/'rps'を設定します。

source: pystubit.board.compass.get_x() Return magnetic field detected along Studuino:bit's X axis. The compass returns the earth's magnetic field in micro-Tesla units. The value will be higher facing magnetic north, and lower facing magnetic south.
ja: pystubit.board.compass.get_x() X軸の磁場を返します。戻り値の型は符号付小数点、デフォルトの単位はマイクロ・テスラです。 N極が近づくと+, S極が近づくと-になります。

source: pystubit.board.compass.get_y() Return magnetic field detected along Studuino:bit's Y axis. The compass returns the earth's magnetic field in micro-Tesla units. The value will be higher facing magnetic north, and lower facing magnetic south.
ja: pystubit.board.compass.get_y() Y軸の磁場を返します。戻り値の型は符号付小数点、デフォルトの単位はマイクロ・テスラです。 N極が近づくと+, S極が近づくと-になります。

source: pystubit.board.compass.get_z() Return magnetic field detected along Studuino:bit's Z axis. The compass returns the earth's magnetic field in micro-Tesla units. The value will be higher facing magnetic north, and lower facing magnetic south.
ja: pystubit.board.compass.get_z() Z軸の磁場を返します。戻り値の型は符号付小数点、デフォルトの単位はマイクロ・テスラです。 N極が近づくと+, S極が近づくと-になります。

source: pystubit.board.compass.get_values() Get the magnetic field measurements from all axes at once, as a three-element tuple of integers (ordered as X, Y, Z).
ja: pystubit.board.compass.get_values() X,Y,Z軸の磁場をタプルで返します。(get_x(), get_y(), get_z())。

source: pystubit.board.compass.calibrate() If Studuino:bit's compass is confused, calibrate() it to adjust the its accuracy. Calibration will ask you to rotate the device to draw a circle on the display. Afterwards, Studuino:bit will know which way is north.
ja: pystubit.board.compass.calibrate() "基板の地磁気センサーが正しい値を示さない場合、実行してください。磁気センサーのキャリブレーションを開始します。LEDディスプレイ上に円を描くようデバイスを回転させます。

source: pystubit.board.compass.is_calibrated() If Studuino:bit's compass is_calibrated() and adjusted for accuracy, return True. If the compass hasn't been adjusted for accuracy, return False.
ja: pystubit.board.compass.is_calibrated() キャリブレーションが成功したかどうかにより True または False を返します。

source: pystubit.board.compass.clear_calibration() Reset Studuino:bit's compass using clear_calibration() command.
ja: pystubit.board.compass.clear_calibration() キャリブレーションを取り消します。

source: pystubit.board.compass.heading() Return a number between 0-360 indicating the device's heading. 180 is north.
ja: pystubit.board.compass.heading() 磁針の向きを返します。0～360°の整数で、時計回りで北が180°になります。

source: pystubit.board.p0.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p0.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p0.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p0.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p0.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p0.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p0.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p0.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p0.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p0.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p0.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p0.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p0.status() Display current PWM usage on REPL.
ja: pystubit.board.p0.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p0.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p0.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p1.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p1.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p1.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p1.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p1.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p1.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p1.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p1.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p1.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p1.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p1.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p1.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p1.status() Display current PWM usage on REPL.
ja: pystubit.board.p1.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p1.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p1.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p2.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p2.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p2.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p2.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p2.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p2.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p2.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p2.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p2.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p2.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p2.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p2.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p2.status() Display current PWM usage on REPL.
ja: pystubit.board.p2.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p2.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p2.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p3.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p3.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p3.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p3.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。
