Repository: mu-editor/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: cs, ja, ta

source: Logging to {}
ja: ログ出力先: {}

source: Debugger requires a Python script filename to run.
ja: デバッガは実行のために Python スクリプトのファイル名を必要とします。

source: Connection timed out. Is your machine slow or busy? Free up some of the machine's resources and try again.
cs: Časový limit spojení vypršel. Není Váš počítač pomalý anebo zaneprázdněný? Pokuste se uvolnit některé zdroje na vašem počítači a zkuste to znova.
ja: 接続がタイムアウトしました。マシンが遅いかビジーになっているようです。マシンのリソースを解放して再度試しください。
ta: இணைப்பின் நேரம் முடிந்தது. உங்கள் இயந்திரம் மெதுவாக அல்லது பிஸியாக இருக்கிறதா? இயந்திரத்தின் சில வளங்களை விடுவித்து மீண்டும் முயற்சிக்கவும்.

source: Could not find localhost. Ensure you have '127.0.0.1 localhost' in your /etc/hosts file.
cs: Nepodařilo se najít localhost. Ujistěte se, že máte záznam '127.0.0.1 localhost' v souboru /etc/hosts.
ja: localhostが見つかりません。/etc/hosts ファイルに '127.0.0.1 localhost' があるか確認してください。
ta: லோக்கல் ஹோஸ்டைக் கண்டுபிடிக்க முடியவில்லை. உங்கள் /ETC /ஹோஸ்ட் கோப்பில் '127.0.0.1 லோக்கல் ஹோஸ்ட்' இருப்பதை உறுதிசெய்க.

source: Select Mode
cs: Zvolte režim
ja: モードの選択
ta: பயன்முறையைத் தேர்ந்தெடுக்கவும்

source: Please select the desired mode then click "OK". Otherwise, click "Cancel".
cs: Zvolte, prosím, požadovaný režim a potom klikněte na tlačítko "OK". V opačném případě klikněte na tlačítko "Zrušit".
ja: 使うモードを選択して "OK" をクリックしてください。モードを変更しない場合は "CANCEL" をクリックしてください。
ta: தயவுசெய்து விரும்பிய பயன்முறையைத் தேர்ந்தெடுத்து, "சரி" என்பதைக் கிளிக் செய்க. இல்லையெனில், "ரத்துசெய்" என்பதைக் கிளிக் செய்க.

source: Change mode at any time by clicking the "Mode" button containing Mu's logo.
cs: Režim můžete kdykoliv změnit kliknutím na tlačítko "Režim" s logem editoru Mu.
ja: Mu のロゴのついた "モード" ボタンをクリックすることにより、いつでもモードを変更できます。
ta: MU இன் லோகோவைக் கொண்ட "பயன்முறை" பொத்தானைக் கிளிக் செய்வதன் மூலம் எந்த நேரத்திலும் பயன்முறையை மாற்றவும்.

source: When reporting a bug, copy and paste the content of the following log file.
cs: Při nahlašování chyby zkopírujte a vložte obsah tohto záznamu.
ja: バグの報告の際には、以下のログファイルの内容をコピー＆ペーストしてください。
ta: பிழையைப் புகாரளிக்கும் போது, பின்வரும் பதிவு கோப்பின் உள்ளடக்கத்தை நகலெடுத்து ஒட்டவும்.

source: The environment variables shown below will be set each time you run a Python 3 script. Each separate enviroment variable should be on a new line and of the form: NAME=VALUE
cs: Proměnné prostředí, které se nachází níže, budou nastavené vždy, když spustíte Python 3 skript. Každá proměnná prostředí by se měla nacházet na novém řádku ve formátu: NÁZEV = HODNOTA
ja: 以下に示す環境変数は Python 3 スクリプトを実行する毎に設定されます。 個々の環境変数は次の形式で改行で区切って指定するようにしてください: 名前=値
ta: கீழே காட்டப்பட்டுள்ள சுற்றுச்சூழல் மாறிகள் ஒவ்வொரு முறையும் நீங்கள் பைதான் 3 ஸ்கிரிப்டை இயக்கும் போது அமைக்கப்படும். ஒவ்வொரு தனித்தனி சூழலும் ஒரு புதிய வரியிலும் வடிவத்திலும் இருக்க வேண்டும்: பெயர் = மதிப்பு

source: Minify Python code before flashing?
cs: Minifikovat Python kód před jeho zapsáním do paměti?
ja: 転送の前に Python コードを縮小しますか？
ta: ஒளிரும் முன் பைதான் குறியீட்டைக் குறைக்கவா?

source: Override the built-in MicroPython runtime with the following hex file (empty means use the default):
cs: Přepsat vestavěný MicroPython následujícim binárním soborem (prázdné pole znamená, že se použije výchozí nastavení):
ja: 組込みの MicroPython ランタイムを以下の hex ファイルで上書きする(空であればデフォルトのものを利用):
ta: உள்ளமைக்கப்பட்ட மைக்ரோபிதான் இயக்க நேரத்தை பின்வரும் ஹெக்ஸ் கோப்புடன் மேலெழுதவும் (வெற்று என்றால் இயல்புநிலையைப் பயன்படுத்தவும்):

source: Mu Administration
cs: Správa Mu
ja: Mu 管理
ta: MU நிர்வாகம்

source: Current Log
cs: Aktuální záznamník
ja: 現在のログ
ta: தற்போதைய பதிவு

source: Python3 Environment
cs: Prostředí Python 3
ja: Python3 環境
ta: பைதான் 3 சூழல்

source: BBC micro:bit Settings
cs: Nastavení BBC micro:bit
ja: BBC micro:bit 設定
ta: பிபிசி மைக்ரோ: பிட் அமைப்புகள்

source: Find / Replace
cs: Najít / Nahradit
ja: 検索 / 置換
ta: கண்டுபிடி / மாற்ற

source: Find:
cs: Najít:
ja: 検索
ta: கண்டுபிடி:

source: Replace (optional):
cs: Nahradit (volitelné):
ja: 置換(オプション)
ta: மாற்றவும் (விரும்பினால்):

source: Replace all?
cs: Nahradit vše?
ja: すべて置換しますか？
ta: அனைத்தையும் மாற்று?

source: untitled
cs: bez názvu
ja: 無題
ta: பெயரிடப்படாதது

source: Mode
cs: Režim
ja: モード
ta: பயன்முறை

source: Change Mu's mode of behaviour.
cs: Změní režim chování Mu.
ja: Mu の動作モードを変更します。
ta: MU இன் நடத்தை முறையை மாற்றவும்.

source: New
cs: Nový
ja: 新規
ta: புதியது

source: Create a new Python script.
cs: Vytvoří nový skript v jazyku Python.
ja: 新しい MicroPython スクリプトを作成します。
ta: புதிய பைதான் ஸ்கிரிப்டை உருவாக்கவும்.

source: Load
cs: Nahrát
ja: 開く
ta: சுமை

source: Load a Python script.
cs: Nahraje skript v jazyku Python.
ja: Python スクリプトを読み込みます。
ta: பைதான் ஸ்கிரிப்டை ஏற்றவும்.

source: Save
cs: Uložit
ja: 保存
ta: சேமிக்கவும்

source: Save the current Python script.
cs: Uloží aktuální skript v jazyku Python.
ja: 現在の Python スクリプトを保存します。
ta: தற்போதைய பைதான் ஸ்கிரிப்டை சேமிக்கவும்.

source: Zoom-in
cs: Přiblížit
ja: 拡大
ta: பெரிதாக்க

source: Zoom in (to make the text bigger).
cs: Přiblížení (aby byl text větší).
ja: 拡大（文字を大きく）します。
ta: பெரிதாக்கவும் (உரையை பெரிதாக்க).

source: Zoom-out
cs: Oddálit
ja: 縮小
ta: ஜூம்-அவுட்

source: Zoom out (to make the text smaller).
cs: Oddálení (aby byl text menší).
ja: 縮小（文字を小さく）します。
ta: பெரிதாக்கவும் (உரையை சிறியதாக மாற்ற).

source: Theme
cs: Téma
ja: テーマ
ta: தீம்

source: Toggle theme between day, night or high contrast.
cs: Přepne téma mezi denním, nočním anebo vysokým kontrastem.
ja: 日中、夜、ハイコントラストのテーマを切り替えます。
ta: பகல், இரவு அல்லது அதிக மாறுபாட்டிற்கு இடையில் கருப்பொருளை மாற்றவும்.

source: Check
cs: Zkontrolovat
ja: チェック
ta: காசோலை

source: Check your code for mistakes.
cs: Zkontroluje, zda se ve vašem kódu nenachází chyby.
ja: コードの間違いをチェックします。
ta: தவறுகளுக்கு உங்கள் குறியீட்டை சரிபார்க்கவும்.

source: Help
cs: Pomocník
ja: ヘルプ
ta: உதவி

source: Show help about Mu in a browser.
cs: Zobrazí pomocníka o Mu v prohlížeči.
ja: Mu のヘルプをWebブラウザで表示します。
ta: உலாவியில் MU பற்றிய உதவியைக் காட்டுங்கள்.

source: Quit
cs: Konec
ja: 終了
ta: விட்டுவிட

source: Quit Mu.
cs: Ukončí Mu.
ja: Mu を終了します。
ta: Mu ஐ விட்டு விடுங்கள்.

source: Cannot connect to device on port {}
cs: Nepodařilo se pripojit k zařízení na portu {}
ja: ポート {} でデバイスに接続できません
ta: போர்ட்டில் சாதனத்துடன் இணைக்க முடியாது {}

source: Filesystem on micro:bit
ja: micro:bit のファイルシステム

source: Python3 data tuple
cs: Datový tuple jazyka Python3
ja: Python3 データタプル
ta: பைதான் 3 தரவு டூப்பிள்

source: {} Plotter
cs: {} Plotr
ja: {} プロッター
ta: {} சதித்திட்டம்

source: Running: {}
cs: Spuštěný: {}
ja: 実行中: {}
ta: ஓடுதல்: {}

source: Debug Inspector
cs: Inspektor ladění
ja: デバッグインスペクタ
ta: பிழைத்திருத்த ஆய்வாளர்

source: Name
cs: Název
ja: 名前
ta: பெயர்

source: Value
cs: Hodnota
ja: 値
ta: மதிப்பு

source: (A list of {} items.)
cs: (Seznam o délce {} položek.)
ja: (項目 {} のリスト。)
ta: (}} உருப்படிகளின் பட்டியல்.)

source: (A dict of {} items.)
cs: (Slovník o délce {} položek.)
ja: (項目 {} の辞書。)
ta: (}} உருப்படிகளின் ஒரு கட்டளை.)

source: Mu's current mode of behaviour.
cs: Aktuální režim chování editoru Mu.
ja: Mu の現在の動作モード。
ta: MU இன் தற்போதைய நடத்தை முறை.

source: File already exists; overwrite it?
cs: Vybraný soubor už existuje; chcete ho přepsat?
ja: ファイルが既にあります。上書きしますか？
ta: கோப்பு ஏற்கனவே உள்ளது; அதை மேலெழுதவா?

source: File already exists
cs: Sobor už existuje
ja: ファイルが既にあります
ta: கோப்பு ஏற்கனவே உள்ளது

source: Copying '{}' to micro:bit.
ja: micro:bit にコピー中。

source: '{}' successfully copied to micro:bit.
ja: '{}' micro:bit へのコピーが成功しました。

source: Delete (cannot be undone)
cs: Odstranit (nevratné)
ja: 削除 (元に戻せません)
ta: நீக்கு (செயல்தவிர்க்க முடியாது)

source: Deleting '{}' from micro:bit.
ja: micro:bit から '{}' を削除中。

source: '{}' successfully deleted from micro:bit.
ja: '{}' micro:bit から '{}' の削除が成功しました。

source: Getting '{}' from micro:bit. Copying to '{}'.
ja: micro:bit から '{}' を取得中。{} にコピー中。

source: Successfully copied '{}' from the micro:bit to your computer.
ja: micro:bit からコンピュータへの '{}' のコピーが成功しました。

source: Deleting '{}' from device.
cs: Odstraňuji soubor '{}' ze zařízení.
ja: デバイスから '{}' を削除中。
ta: சாதனத்திலிருந்து '{}' நீக்குகிறது.

source: '{}' successfully deleted from device.
cs: Ze zařízení se úspěšně odstranil soubor '{}'.
ja: '{}' デバイスから '{}' の削除が成功しました。
ta: '{}' சாதனத்திலிருந்து வெற்றிகரமாக நீக்கப்பட்டது.

source: Getting '{}' from device. Copying to '{}'.
cs: Získávám soubor '{}' ze zařízení. Kopíruji do '{}'.
ja: デバイスから '{}' を取得中。{} にコピー中。
ta: சாதனத்திலிருந்து '{}' பெறுதல். '{}' க்கு நகலெடுக்கும்.

source: Successfully copied '{}' from the device to your computer.
cs: Soubor '{}' se úspěšně zkopíroval ze zařízení na váš počítač.
ja: デバイスからコンピュータへの '{}' のコピーが成功しました。
ta: சாதனத்திலிருந்து உங்கள் கணினிக்கு '{}' வெற்றிகரமாக நகலெடுக்கப்பட்டது.

source: Open in Mu
cs: Otevřít v Mu
ja: Mu で開く
ta: MU இல் திறந்திருக்கும்

source: Open
cs: Otevřít
ja: 開く
ta: திறந்த

source: Opening '{}'
cs: Otevírám '{}'
ja: 開き中 '{}'

source: Files on your micro:bit:
ja: micro:bit のファイル:

source: Files on your computer:
cs: Soubory na vašem počítači:
ja: コンピュータのファイル:
ta: உங்கள் கணினியில் உள்ள கோப்புகள்:

source: There was a problem getting the list of files on the micro:bit. Please check Mu's logs for technical information. Alternatively, try unplugging/plugging-in your micro:bit and/or restarting Mu.
ja: micro:bit 内のファイルのリストを取得する際に問題が発生しました。技術的な情報は Mu のログを確認してください。または micro:bit のプラグを抜き差しするか、Muを再起動してみてください。

source: There was a problem copying the file '{}' onto the micro:bit. Please check Mu's logs for more information.
ja: micro:bit にファイル '{}' をコピーしている際に問題が発生しました。詳しくは Mu のログを確認してください。

source: There was a problem deleting '{}' from the micro:bit. Please check Mu's logs for more information.
ja: micro:bit 内のファイル '{}' を削除している際にに問題が発生しました。詳しくは Mu のログを確認してください。

source: There was a problem getting '{}' from the micro:bit. Please check Mu's logs for more information.
ja: micro:bit 内のファイル '{}' を取得している際に問題が発生しました。詳しくは Mu のログを確認してください。

source: There was a problem getting the list of files on the device. Please check Mu's logs for technical information. Alternatively, try unplugging/plugging-in your device and/or restarting Mu.
cs: Pri získávání seznamu souborů z vašeho zařízení se vyskytl problém. Pro další technické informace o tomto problému, prosím, zkontrolujte záznamník editoru Mu. Popřípadě můžete zkusit odpojit a připojit vaše zařízení a/nebo restartovat Mu.
ja: デバイス内のファイルのリストを取得する際に問題が発生しました。技術的な情報は Mu のログを確認してください。またはデバイスのプラグを抜き差しするか、Muを再起動してみてください。
ta: சாதனத்தில் கோப்புகளின் பட்டியலைப் பெறுவதில் சிக்கல் இருந்தது. தொழில்நுட்ப தகவல்களுக்கு MU இன் பதிவுகளை சரிபார்க்கவும். மாற்றாக, உங்கள் சாதனத்தை அவிழ்த்து/செருகுவதை முயற்சிக்கவும்/அல்லது MU ஐ மறுதொடக்கம் செய்ய முயற்சிக்கவும்.

source: There was a problem copying the file '{}' onto the device. Please check Mu's logs for more information.
cs: Během kopírování souboru '{}' na zařízení se stala chyba. Pro více informací, prosím, zkontrolujte záznamník editoru Mu.
ja: デバイスにファイル '{}' をコピーしている際に問題が発生しました。詳しくは Mu のログを確認してください。
ta: சாதனத்தில் '{}' கோப்பை நகலெடுப்பதில் சிக்கல் இருந்தது. மேலும் தகவலுக்கு MU இன் பதிவுகளை சரிபார்க்கவும்.

source: There was a problem deleting '{}' from the device. Please check Mu's logs for more information.
cs: Během odstraňování souboru '{}' z vašeho zařízení se stala chyba. Pro více informací, prosím, zkontrolujte záznamník editoru Mu.
ja: デバイス内のファイル '{}' を削除している際にに問題が発生しました。詳しくは Mu のログを確認してください。
ta: சாதனத்திலிருந்து '{}' நீக்குவதில் சிக்கல் இருந்தது. மேலும் தகவலுக்கு MU இன் பதிவுகளை சரிபார்க்கவும்.

source: There was a problem getting '{}' from the device. Please check Mu's logs for more information.
cs: Během získávání souboru '{}' z vašeho zařízení se stala chyba. Pro více informací, prosím, zkontrolujte záznamník editoru Mu.
ja: デバイス内のファイル '{}' を取得している際に問題が発生しました。詳しくは Mu のログを確認してください。
ta: சாதனத்திலிருந்து '{}' பெறுவதில் சிக்கல் இருந்தது. மேலும் தகவலுக்கு MU இன் பதிவுகளை சரிபார்க்கவும்.

source: This editor is free software written in Python. You can modify it, add features or fix bugs if you like.
cs: Tento editor je otevřený software napísaný v jazyku Python. Pokud chcete, můžete jej upravovat, přidávat nové funkce anebo opravovat chyby.
ja: このエディタは Python で作成したフリーソフトウェアです。あなたの好きなように変更、機能追加、バグ修正できます。
ta: இந்த ஆசிரியர் பைத்தானில் எழுதப்பட்ட இலவச மென்பொருள். நீங்கள் விரும்பினால் அதை மாற்றலாம், அம்சங்களைச் சேர்க்கலாம் அல்லது பிழைகள் சரிசெய்யலாம்.

source: This editor is called Mu (you say it 'mew' or 'moo').
cs: Tento editor sa jmenuje Mu (vyslovuje sa ako 'mjú' alebo 'mú').
ja: このエディタの名前は Mu です('mew' とか 'moo' とか発音します)。
ta: இந்த ஆசிரியர் MU என்று அழைக்கப்படுகிறார் (நீங்கள் அதை 'மியூ' அல்லது 'மூ' என்று சொல்கிறீர்கள்).

source: Google, Facebook, NASA, Pixar, Disney and many more use Python.
cs: Google, Facebook, NASA, Pixar, Disney a mnoho ďalších používají Python.
ja: Google, Facebook, NASA, Pixar, Disney など多くが Python を使っている。
ta: கூகிள், பேஸ்புக், நாசா, பிக்சர், டிஸ்னி மற்றும் பலரும் பைத்தானைப் பயன்படுத்துகின்றனர்.

source: Programming is a form of magic. Learn to cast the right spells with code and you'll be a wizard.
cs: Programovanie je forma magie. Naučte sa vyvolávat správná kouzla pomocí kódu a stanete sa kouzelníky.
ja: プログラミングは魔法の一種。正しいスペルをコードで書く方法を学ぶと魔法使いになれる。
ta: நிரலாக்கமானது மந்திரத்தின் ஒரு வடிவம். சரியான மந்திரங்களை குறியீட்டைக் கொண்டு கற்றுக் கொள்ளுங்கள், நீங்கள் ஒரு மந்திரவாதியாக இருப்பீர்கள்.

source: REPL stands for read, evaluate, print, loop. It's a fun way to talk to your computer! :-)
cs: REPL je skratka pre read (čti), evaluate (vyhodnoť), print (vypiš), loop (opakuj). Představuje zábavný způsob, jak můžete komunikovat se svým počítačem! :-)
ja: REPLは、read (読む)、evaluate (評価)、print (印字)、loop (ループ)の略。 それはあなたのコンピュータと話す楽しい手段です！ :-)
ta: REPL என்பது படிக்க, மதிப்பீடு, அச்சிடுதல், லூப் ஆகியவற்றைக் குறிக்கிறது. உங்கள் கணினியுடன் பேச இது ஒரு வேடிக்கையான வழி! :-)

source: Be brave, break things, learn and have fun!
cs: Buďte odvážní, rozebírejte věci, učte se a bavte se!
ja: 勇気を出そう、前に進もう、学び、楽しもう！
ta: தைரியமாக இருங்கள், விஷயங்களை உடைக்கவும், கற்றுக்கொள்ளவும், வேடிக்கையாகவும் இருங்கள்!

source: Make your software both useful AND fun. Empower your users.
cs: Tvořte svůj software tak, aby byl užitečný A zábavný. Dopřejtě svým uživatelům více možností.
ja: ソフトウェアを便利で楽しいものにしよう。それがユーザの助けになるのです。
ta: உங்கள் மென்பொருளை பயனுள்ளதாகவும் வேடிக்கையாகவும் ஆக்குங்கள். உங்கள் பயனர்களுக்கு அதிகாரம் அளிக்கவும்.

source: For the Zen of Python: import this
ja: Zen of Python を見る方法: import this
ta: பைத்தானின் ஜென்: இதை இறக்குமதி செய்யுங்கள்

source: Diversity promotes creativity.
cs: Rozmanitost podporuje kreativitu.
ja: 多様性は創造性を促進する。
ta: பன்முகத்தன்மை படைப்பாற்றலை ஊக்குவிக்கிறது.

source: An open mind, spirit of adventure and respect for diversity are key.
cs: Klíčem je otevřená mysl, dobrodružný duch a respekt k rozmanitosti.
ja: 開かれた心、冒険の精神、多様性の尊重が重要です。
ta: ஒரு திறந்த மனம், சாகசத்தின் ஆவி மற்றும் பன்முகத்தன்மைக்கு மரியாதை ஆகியவை முக்கியம்.

source: Don't worry if it doesn't work. Learn the lesson, fix it and try again! :-)
cs: Netrapte se, když to nefunguje. Poučte se, opravte to a zkuste to znova! :-)
ja: 動作しなくても心配するな。その失敗から学び、修正してやり直すのだ！ :-)
ta: அது வேலை செய்யவில்லை என்றால் கவலைப்பட வேண்டாம். பாடத்தைக் கற்றுக் கொள்ளுங்கள், அதை சரிசெய்து மீண்டும் முயற்சிக்கவும்! :-)

source: Coding is collaboration.
cs: Programování je o spolupráci.
ja: コーディングはコラボレーションである。
ta: குறியீட்டு முறை ஒத்துழைப்பு.

source: Compliment and amplify the good things with code.
ja: コードのよいところに感謝し、それを広めよう。
ta: குறியீட்டைக் கொண்டு நல்ல விஷயங்களை பாராட்டவும் பெருக்கவும்.

source: In theory, theory and practice are the same. In practice, they're not. ;-)
cs: Teoreticky jsou teorie a praxe totožné. Prakticky tomu tak není. ;-)
ja: 理論的には理論と実践は同じであるが、実践的にはそうではない。 ;-)
ta: கோட்பாட்டில், கோட்பாடு மற்றும் நடைமுறை ஒன்றே. நடைமுறையில், அவர்கள் இல்லை. ;-)

source: Debugging is twice as hard as writing the code in the first place.
cs: Hledání chyb je dvakrát náročnější než psaní nového kódu.
ja: デバッグ作業は、最初にコードを書くときよりも倍難しい。
ta: பிழைத்திருத்தம் குறியீட்டை முதலில் எழுதுவதை விட இரண்டு மடங்கு கடினம்.

source: It's fun to program.
cs: Programování je zábava.
ja: プログラミングは楽しい。
ta: நிரல் செய்வது வேடிக்கையாக உள்ளது.

source: Programming has more to do with problem solving than writing code.
cs: Programování má víc společného s řešením problémů než se psaním kódu.
ja: プログラミングとは、コードを書くだけにあらず、問題解決するということである。
ta: குறியீட்டை எழுதுவதை விட சிக்கல் தீர்க்கும் விஷயங்களுடன் நிரலாக்கமானது அதிகம்.

source: Start with your users' needs.
cs: Začínejte s potřebami vašich uživatelů.
ja: ユーザのニーズから始めなさい。
ta: உங்கள் பயனர்களின் தேவைகளுடன் தொடங்கவும்.

source: Try to see things from your users' point of view.
cs: Snažte se dívat na věci očima vašich uživatelů.
ja: ユーザの視点から物事を見てください。
ta: உங்கள் பயனர்களின் பார்வையில் இருந்து விஷயங்களைக் காண முயற்சிக்கவும்.

source: Put yourself in your users' shoes.
cs: Vžijte se do vašich uživatelů.
ja: ユーザの立場で考えてください。
ta: உங்கள் பயனர்களின் காலணிகளில் நீங்களே இருங்கள்.

source: Explaining a programming problem to a friend often reveals the solution. :-)
cs: Vysvětlení problému s kódem kamarádovi častokrát odhalí jeho řešení. :-)
ja: 友人にプログラムの問題の問題を説明することで、解決策が明らかになることはよくある。 :-)
ta: ஒரு நண்பருக்கு ஒரு நிரலாக்க சிக்கலை விளக்குவது பெரும்பாலும் தீர்வை வெளிப்படுத்துகிறது. :-)

source: If you don't know, ask. Nobody to ask? Just look it up.
cs: Když něco nevíš, tak se zeptej. Nikdo není nablízku? Tak si to najdi.
ja: 分からないことがあるなら質問してください。質問はありませんか？
ta: உங்களுக்குத் தெரியாவிட்டால், கேளுங்கள். கேட்க யாரும் இல்லை? அதைப் பாருங்கள்.

source: Complexity is the enemy. KISS - keep it simple, stupid!
cs: Složitost je nepřítel. KISS - keep it simple, stupid! (udržuj to krátké a jednoduché, blboune)
ja: 複雑さは敵である。KISS - keep it simple, stupid! (単純にしておけ、この間抜け！)
ta: சிக்கலானது எதிரி. முத்தம் - அதை எளிமையாக வைத்திருங்கள், முட்டாள்!

source: Beautiful is better than ugly.
cs: Krásný je lepší než škaredý.
ja: 醜いより美しいほうがいい。
ta: அசிங்கத்தை விட அழகானது சிறந்தது.

source: Explicit is better than implicit.
cs: Explicitní je lepší než implicitní.
ja: 暗示するより明示するほうがいい。
ta: மறைமுகத்தை விட வெளிப்படையானது சிறந்தது.

source: Simple is better than complex. Complex is better than complicated.
cs: Jednoduché je lepší než složité. Složité je lepší než komplikované.
ja: 複雑であるよりは平易であるほうがいい。それでも、込み入っているよりは複雑であるほうがまし。
ta: சிக்கலானதை விட எளிமையானது சிறந்தது. சிக்கலானதை விட சிக்கலானது சிறந்தது.

source: Flat is better than nested.
ja: ネストは浅いほうがいい。
ta: உள்ளமை விட பிளாட் சிறந்தது.

source: Sparse is better than dense.
ja: 密集しているよりは隙間があるほうがいい。
ta: அடர்த்தியை விட சிதறல் சிறந்தது.

source: Readability counts.
cs: Čitelnost se počítá.
ja: 読みやすいことは善である。
ta: வாசிப்பு எண்ணிக்கை.

source: Special cases aren't special enough to break the rules. Although practicality beats purity.
cs: Výjimky nejsou tak výjimečné, aby se kvůli nim porušovaly pravidla. I když, praktičnost poráží čistotu.
ja: 特殊であることはルールを破る理由にならない。しかし、実用性を求めると自然さが失われることがある。
ta: சிறப்பு வழக்குகள் விதிகளை மீறுவதற்கு போதுமானதாக இல்லை. நடைமுறை தூய்மையை அடித்தது என்றாலும்.

source: Errors should never pass silently. Unless explicitly silenced.
cs: Chyby by nikdy něly projít potichu. Pokud nejsou cíleně a výslovně umlčané.
ja: エラーは隠すな、無視するな。ただし、わざと隠されているのなら見逃せ。
ta: பிழைகள் ஒருபோதும் அமைதியாக கடக்கக்கூடாது. வெளிப்படையாக அமைதியாக இல்லாவிட்டால்.

source: In the face of ambiguity, refuse the temptation to guess.
cs: Ve jménu nejednoznačnosti, odolávejte svodům k odhadu.
ja: 曖昧なものに出逢ったら、その意味を適当に推測してはいけない。
ta: தெளிவற்ற தன்மையை எதிர்கொண்டு, யூகிக்க சோதனையை மறுக்கவும்.

source: There should be one-- and preferably only one --obvious way to do it.
cs: Měl by existovat jeden – a pokud možno jen jeden – zřejmý způsob, jak to udělat.
ja: たったひとつの冴えたやりかたがあるはずだ。
ta: ஒன்று இருக்க வேண்டும்-மற்றும் முன்னுரிமை ஒன்று மட்டுமே-அதைச் செய்வதற்கான வழி.

source: Now is better than never. Although never is often better than *right* now.
cs: Teď je lepší než nikdy. I když, nikdy je častokrát lepší než *právě* teď.
ja: ずっとやらないでいるよりは、今やれ。でも、今"すぐ"にやるよりはやらないほうがマシなことが多い。
ta: இப்போது ஒருபோதும் இல்லாததை விட சிறந்தது. இப்போது * சரியான * ஐ விட ஒருபோதும் சிறப்பாக இல்லை என்றாலும்.

source: If the implementation is hard to explain, it's a bad idea.
cs: Když se řešení špatně vysvětluje, je to špatný nápad.
ja: コードの内容を説明するのが難しいのなら、それは悪い実装である。
ta: செயல்படுத்தலை விளக்குவது கடினம் என்றால், இது ஒரு மோசமான யோசனை.

source: If the implementation is easy to explain, it may be a good idea.
cs: Když se dá řešení snadno vysvětlit, může to být dobrý nápad.
ja: コードの内容を容易に説明できるのなら、おそらくそれはよい実装である。
ta: செயல்படுத்தல் விளக்க எளிதானது என்றால், அது ஒரு நல்ல யோசனையாக இருக்கலாம்.

source: Namespaces are one honking great idea -- let's do more of those!
cs: Jmenné prostory jsou skvělý nápad -- udělejme jich víc!
ja: 名前空間は優れたアイデアであるため、積極的に利用すべきである。
ta: பெயர்வெளிகள் ஒரு சிறந்த யோசனையாகும் - அவற்றில் பலவற்றைச் செய்வோம்!

source: Mu was created by Nicholas H.Tollervey.
cs: Mu vytvořil Nicholas H.Tollervey.
ja: Mu は Nicholas H.Tollervey が作成しました。
ta: MU ஐ நிக்கோலஸ் எச்.டொல்லர்வி உருவாக்கினார்.

source: To understand what recursion is, you must first understand recursion.
cs: Abyste pochopili, co je to rekurze, musíte najdříve pochopit rekurzi.
ja: 再帰とは何かを理解するためには、まず再帰を理解する必要がある。
ta: மறுநிகழ்வு என்றால் என்ன என்பதைப் புரிந்து கொள்ள, நீங்கள் முதலில் மறுநிகழ்வைப் புரிந்து கொள்ள வேண்டும்.

source: Algorithm: a word used by programmers when they don't want to explain what they did.
cs: Algoritmus: slovo používané programátory, když nechtějí vysvětlovat, čo udělali.
ja: アルゴリズム: プログラマーが何をしているかを説明したくないときに使う言葉。
ta: அல்காரிதம்: புரோகிராமர்கள் அவர்கள் செய்ததை விளக்க விரும்பாதபோது பயன்படுத்தும் ஒரு சொல்.

source: Programmers count from zero.
cs: Programátoři počítají od nuly.
ja: プログラマーはゼロから数える。
ta: புரோகிராமர்கள் பூஜ்ஜியத்திலிருந்து எண்ணுகிறார்கள்.

source: Simplicity is the ultimate sophistication.
cs: Jednoduchost je najvyšší úroveň sofistikovanosti.
ja: 単純であることは究極の洗練である。
ta: எளிமையே வாழ்க்கையின் உயர்ந்த பண்பு.

source: A good programmer is humble.
cs: Dobrý programátor je pokorný.
ja: 優れたプログラマーは謙虚である。
ta: ஒரு நல்ல புரோகிராமர் தாழ்மையானவர்.

source: A good programmer is playful.
cs: Dobrý programátor je hravý.
ja: 優れたプログラマーには遊び心がある。
ta: ஒரு நல்ல புரோகிராமர் விளையாட்டுத்தனமானவர்.

source: A good programmer learns to learn.
cs: Dobrý programátor se učí se učit.
ja: 優れたプログラマーは学ぶことを学ぶ。
ta: ஒரு நல்ல புரோகிராமர் கற்றுக்கொள்ள கற்றுக்கொள்கிறார்.

source: A good programmer thinks beyond the obvious.
cs: Dobrý programátor přemýšlí i za hranici zjevného
ja: 優れたプログラマーは当たり前の一つ上を考えている。
ta: ஒரு நல்ல புரோகிராமர் வெளிப்படையானதைத் தாண்டி சிந்திக்கிறார்.

source: A good programmer promotes simplicity.
cs: Dobrý programátor podporuje jednoduchost.
ja: 優れたプログラマーは単純さを推し進める。
ta: ஒரு நல்ல புரோகிராமர் எளிமை ஊக்குவிக்கிறார்.

source: A good programmer avoids complexity.
cs: Dobrý programátor se vyhýbá složitosti.
ja: 優れたプログラマーは複雑さを避ける。
ta: ஒரு நல்ல புரோகிராமர் சிக்கலைத் தவிர்க்கிறார்.

source: A good programmer is patient.
cs: Dobrý programátor je trpělivý.
ja: 優れたプログラマーは病気である。
ta: ஒரு நல்ல புரோகிராமர் பொறுமையாக இருக்கிறார்.

source: A good programmer asks questions.
cs: Dobrý programátor se ptá.
ja: 優れたプログラマーは問いかける。
ta: ஒரு நல்ல புரோகிராமர் கேள்விகளைக் கேட்கிறார்.

source: A good programmer is willing to say, 'I don't know'.
cs: Dobrý programátor je ochotný říct: 'Nevím'.
ja: 優れたプログラマーは「わからない」と言っても構わない。
ta: ஒரு நல்ல புரோகிராமர், 'எனக்குத் தெரியாது' என்று சொல்ல தயாராக இருக்கிறார்.

source: Wisest are they that know they know nothing.
cs: Nejmoudřejší jsou ti, kteří ví, že nič neví.
ja: 賢明であるとは、知らないことを知っていることである。
ta: அவர்களுக்கு எதுவும் தெரியாது என்று தெரிந்தவர்கள் புத்திசாலிகள்.

source: above this line
cs: nad tímto řádkem
ja: この行の上
ta: இந்த வரிக்கு மேலே

source: Syntax error. Python cannot understand this line. Check for missing characters!
cs: Syntaktická chyba. Python nemůže pochopit tento řádek. Zkontrolujte chybějící znaky!
ja: 文法エラー。Python はこの行を理解できません。間違った綴りがないか調べてください！
ta: தொடரியல் பிழை. பைத்தானால் இந்த வரியை புரிந்து கொள்ள முடியாது. காணாமல் போன எழுத்துக்களைச் சரிபார்க்கவும்!
