Repository: mu-editor/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: cs, ja, ta

source: pystubit.board.p15.status() Display current PWM usage on REPL.
ja: pystubit.board.p15.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p16.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p16.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p16.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p16.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p16.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p16.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p16.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p16.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p16.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p16.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p16.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p16.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p16.status() Display current PWM usage on REPL.
ja: pystubit.board.p16.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p16.read_analog(mv=False) Read the voltage applied to pin. If mv=False, return the reading as a number between 0 (meaning 0v) and 4095. If mv=True, return the reading in millivolts.
ja: pystubit.board.p16.read_analog(mv=False) 端子からアナログ信号をリードします。 mv=Falseの場合、0～4095の整数を返します。mv=Trueの場合、電圧をmV（ミリ・ボルト）で返します。

source: pystubit.board.p19.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p19.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p19.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p19.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p19.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p19.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p19.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p19.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p19.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p19.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p19.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p19.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p19.status() Display current PWM usage on REPL.
ja: pystubit.board.p19.status() PWMの使用状況をREPLに表示します。

source: pystubit.board.p20.write_digital(value) Write digital output to a pin. Set pin to output high if value is 1, or to low, if it is 0.
ja: pystubit.board.p20.write_digital(value) 端子からデジタル出力します。 value引数が1の場合はハイに設定し、0の場合はローに設定します。

source: pystubit.board.p20.read_digital() Read digital value from pin. The reading will be either 0 (low) or 1 (high).
ja: pystubit.board.p20.read_digital() 端子からデジタル信号をリードします。 戻り値は、ハイの場合は1、ローの場合は0を返します。

source: pystubit.board.p20.write_analog(value) Output PWM signal. Set the output from 0 (0%) to 100 (100%).
ja: pystubit.board.p20.write_analog(value) PWM信号を端子に出力します。 value引数は、浮動小数点数で、0(0%)～100(100%)を設定します。

source: pystubit.board.p20.set_analog_period(period, timer=-1) Set the period of the PWM signal output to period milliseconds. The minimum period is 1ms. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p20.set_analog_period(period, timer=-1) PWM 信号の周期を period にミリ秒単位で設定します。有効な最小値は 1ms です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p20.set_analog_period_microseconds(period, timer=-1) Set the period of the PWM signal output to period microseconds. The minimum period is 256us. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p20.set_analog_period_microseconds(period, timer=-1) PWM 信号の周期を period にマイクロ秒単位で設定します。有効な最小値は 256μs です。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p20.set_analog_hz(hz, timer=-1) Set the period of the PWM signal output to period frequency. You can set the PWM's timer by picking a timer ID 0-3.
ja: pystubit.board.p20.set_analog_hz(hz, timer=-1) PWM 信号の周期を周波数で設定します。 timer引数でPWMに使用するタイマーのIDを0～3で設定できます。

source: pystubit.board.p20.status() Display current PWM usage on REPL.
ja: pystubit.board.p20.status() PWMの使用状況をREPLに表示します。

source: pyatcrobo2.parts.DCMotor(pin) Create a DC Motor instance. The pin parameter can be set to either 'M1' or 'M2' to specify a pin with a DC Motor connected to it.
ja: pyatcrobo2.parts.DCMotor(pin) DCモーターのインスタンスを生成します。 pin引数にDCモーターを接続しているピンを文字列（'M1'/ 'M2'）で指定します。

source: pyatcrobo2.parts.DCMotor.cw() Spin a DC Motor clockwise.
ja: pyatcrobo2.parts.DCMotor.cw() DCモーターを正転で回転します。

source: pyatcrobo2.parts.DCMotor.ccw() Spin a DC Motor counter-clockwise.
ja: pyatcrobo2.parts.DCMotor.ccw() DCモーターを逆転で回転します。

source: pyatcrobo2.parts.DCMotor.stop() Stop powering a DC Motor, allowing it to coast to a stop.
ja: pyatcrobo2.parts.DCMotor.stop() DCモーターの回転を脱力で停止します。

source: pyatcrobo2.parts.DCMotor.brake() Stop a DC Motor's rotation.
ja: pyatcrobo2.parts.DCMotor.brake() DCモーターを回転を停止します。

source: pyatcrobo2.parts.DCMotor.power(power) Set a DC Motor's speed. The speed can be set from 0 (slowest) to 255 (fastest).
ja: pyatcrobo2.parts.DCMotor.power(power) DCモーターのパワーを設定します。 power引数には、0～255の整数を設定します。

source: pyatcrobo2.parts.Servomotor(pin) Create a Servomotor instance. The pin parameter can be set to 'P13', 'P14', 'P15', or 'P16' to specify a pin with a Servomotor connected to it.
ja: pyatcrobo2.parts.Servomotor(pin) サーボモーターのインスタンスを生成します。 pin引数にサーボモーターを接続しているピンを文字列（'P13'/'P14'/ 'P15'/ 'P16'）で指定します。

source: pyatcrobo2.parts.Servomotor.set_angle(degree) Set a Servomotor's angle. The angle can be sety in degrees 0-180.
ja: pyatcrobo2.parts.Servomotor.set_angle(degree) サーボモーターの角度を制御します。 degree引数に角度(0～180)を整数で設定します。

source: pyatcrobo2.parts.Buzzer(pin) Create a Buzzer instance. The pin parameter can be set to 'P13', 'P14', 'P15', or 'P16' to specify a pin with a Buzzer connected to it.
ja: pyatcrobo2.parts.Buzzer(pin) ブザーのインスタンスを生成します。 pin引数にブザーを接続しているピンを文字列（'P13'/'P14'/ 'P15'/ 'P16'）で指定します。

source: pyatcrobo2.parts.Buzzer.on(sound, volume=-1, duration=-1) Set a specific note for the Buzzer to play. The note can be set using strings ('C3'-'G9'), MIDI note numbers ('48'-'127') or frequencies (in integers). The volume can be set by percentage (0-99). Duration can be set in milliseconds to make the sound play for a pre-set length of time.
ja: pyatcrobo2.parts.Buzzer.on(sound, volume=-1, duration=-1) ブザーから指定された高さの音を出力します。 sound引数には、文字列で'C3'～'G9'のコード、'48'～'127'のMIDIノートナンバー、整数で周波数を設定します。 volume引数には、ボリュームを百分率（整数（0～99））で設定します。 duration引数に正の整数を設定した場合、設定した値（ミリ秒単位）の間、音を出力します。

source: pyatcrobo2.parts.Buzzer.off() Stop any current sound output.
ja: pyatcrobo2.parts.Buzzer.off() 音が出力されている場合、停止します。

source: pyatcrobo2.parts.LED(pin) Create an LED instance. The pin parameter can be set to 'P13', 'P14', 'P15', or 'P16' to specify a pin with an LED connected to it.
ja: pyatcrobo2.parts.LED(pin) LEDのインスタンスを生成します。 pin引数にLEDを接続しているピンを文字列（'P13'/'P14'/'P15'/'P16'）で指定します。

source: pyatcrobo2.parts.LED.on() Turn on an LED.
ja: pyatcrobo2.parts.LED.on() LEDを点灯します。

source: pyatcrobo2.parts.LED.off() Turn off an LED.
ja: pyatcrobo2.parts.LED.off() LEDを消灯します。

source: pyatcrobo2.parts.IRPhotoReflector(pin) Create an IR Photoreflector instance. The pin parameter can be set to 'P0', 'P1', or 'P2' to specify a pin with an IR Photoreflector connected to it.
ja: pyatcrobo2.parts.IRPhotoReflector(pin) 赤外線フォトリフレクタのインスタンスを生成します。 pin引数に赤外線フォトリフレクタを接続しているピンを文字列（'P0'/'P1'/'P2'）で指定します。

source: pyatcrobo2.parts.IRPhotoReflector.get_value() Retrieve current sensor value (0-4095).
ja: pyatcrobo2.parts.IRPhotoReflector.get_value() センサーの値(0～4095)を取得します。

source: pyatcrobo2.parts.LightSensor(pin) Create a Light Sensor instance. The pin parameter can be set to 'P0', 'P1', or 'P2' to specify a pin with a Light Sensor connected to it.
ja: pyatcrobo2.parts.LightSensor(pin) 光センサーのインスタンスを生成します。 pin引数に光センサーを接続しているピンを文字列（'P0'/'P1'/'P2'）で指定します。

source: pyatcrobo2.parts.LightSensor.get_value() Retrieve current sensor value (0-4095).
ja: pyatcrobo2.parts.LightSensor.get_value() センサーの値(0～4095)を取得します。

source: pyatcrobo2.parts.Temperature(pin) Create a Temperature Sensor instance. The pin parameter can be set to 'P0', 'P1', or 'P2' to specify a pin with a Temperature Sensor connected to it.
ja: pyatcrobo2.parts.Temperature(pin) 温度センサーのインスタンスを生成します。 pin引数に温度センサーを接続しているピンを文字列（'P0'/'P1'/'P2'）で指定します。

source: pyatcrobo2.parts.Temperature.get_value() Retrieve current sensor value (0-4095).
ja: pyatcrobo2.parts.Temperature.get_value() センサーの値(0～4095)を取得します。

source: pyatcrobo2.parts.Temperature.get_celsius() Retrieve current sensor value in degrees Celsius.
ja: pyatcrobo2.parts.Temperature.get_celsius() センサーの値を温度（セ氏）で取得します。

source: pyatcrobo2.parts.SoundSensor(pin) Create a Sound Sensor instance. The pin parameter can be set to 'P0', 'P1', or 'P2' to specify a pin with a Sound Sensor connected to it.
ja: pyatcrobo2.parts.SoundSensor(pin) 音センサーのインスタンスを生成します。 pin引数に音センサーを接続しているピンを文字列（'P0'/'P1'/'P2'）で指定します。

source: pyatcrobo2.parts.SoundSensor.get_value() Retrieve current sensor value (0-4095).
ja: pyatcrobo2.parts.SoundSensor.get_value() センサーの値(0～4095)を取得します。

source: pyatcrobo2.parts.TouchSensor(pin) Create a Touch Sensor instance. The pin parameter can be set to 'P0', 'P1', or 'P2' to specify a pin with a Touch Sensor connected to it.
ja: pyatcrobo2.parts.TouchSensor(pin) タッチセンサーのインスタンスを生成します。 pin引数にタッチセンサーを接続しているピンを文字列（'P0'/'P1'/'P2'）で指定します。

source: pyatcrobo2.parts.TouchSensor.get_value() Retrieve current sensor value (0/1).
ja: pyatcrobo2.parts.TouchSensor.get_value() センサーの値(0/1)を取得します。

source: pyatcrobo2.parts.Accelerometer(pin) Create an Accelerometer instance. Use 'I2C' to set the Accelerometer's pin.
ja: pyatcrobo2.parts.Accelerometer(pin) 加速度センサーのインスタンスを生成します。 pin引数に加速度センサーを接続しているピンを文字列（'I2C'）で指定します。

source: pyatcrobo2.parts.Accelerometer.configuration(highres, scale) Change the Accelerometer's settings. High res can be set to True (16-bit resolution) or False (8-bit resolution). The Accelerometer's maximum measurable acceleration can be set to 2, 4, or 8 (from 2G to 8G).
ja: pyatcrobo2.parts.Accelerometer.configuration(highres, scale) 加速度センサーを設定します。 highres引数には、高解像度指定をTrue/Falseで設定します。Trueを指定した場合、解像度は16bit、Falseを指定した場合、解像度は8bitになります。 scale引数には、加速度の測定範囲(2G～8G)を指定します。整数で2,4,8をのいずれかを設定します。

source: pyatcrobo2.parts.Accelerometer.get_x() Return tilt (X acceleration) in m/s/s's.
ja: pyatcrobo2.parts.Accelerometer.get_x() X軸の加速度を返します。戻り値の型は符号付整数、デフォルトの単位はメートル/秒/秒です。

source: pyatcrobo2.parts.Accelerometer.get_y() Return tilt (Y acceleration) in m/s/s's.
ja: pyatcrobo2.parts.Accelerometer.get_y() Y軸の加速度を返します。戻り値の型は符号付整数、デフォルトの単位はメートル/秒/秒です。

source: pyatcrobo2.parts.Accelerometer.get_z() Return tilt (Z acceleration) in m/s/s's.
ja: pyatcrobo2.parts.Accelerometer.get_z() Z軸の加速度を返します。戻り値の型は符号付整数、デフォルトの単位はメートル/秒/秒です。

source: pyatcrobo2.parts.Accelerometer.get_values() Get the acceleration measurements in all axes at once, as a three-element tuple of integers (ordered as X, Y, Z).
ja: pyatcrobo2.parts.Accelerometer.get_values() X,Y,Z軸の加速度をタプルで返します。(get_x(), get_y(), get_z())。

source: The packages shown below will be available to import in Python 3 mode. Delete a package from the list to remove its availability. Each separate package name should be on a new line. Packages are installed from PyPI (see: https://pypi.org/).
cs: Níže zobrazené balíčky bude možné importovať v režimu Python 3. Odstraněním balíčku ze seznamu zamezíte jeho dostupnosti. Název každého samostatného balíčku by se měl nacházet na novém řádku. Balíčky jsou instalované z PyPI (viz: https://pypi.org/).
ta: கீழே காட்டப்பட்டுள்ள தொகுப்புகள் பைதான் 3 பயன்முறையில் இறக்குமதி செய்ய கிடைக்கும். பட்டியலிலிருந்து அதன் கிடைக்கும் தன்மையை அகற்ற ஒரு தொகுப்பிலிருந்து நீக்கவும். ஒவ்வொரு தனி தொகுப்பு பெயரும் புதிய வரியில் இருக்க வேண்டும். PYPI இலிருந்து தொகுப்புகள் நிறுவப்பட்டுள்ளன (பார்க்க: https://pypi.org/).

source: The folks at <a href='https://www.pythonanywhere.com/'>PythonAnywhere</a> make it easy for learners and educators to host simple web projects for free. You'll need to sign up for an account and provide the following details for Mu to deploy your web project.
cs: Parta na <a href='https://www.pythonanywhere.com/'>PythonAnywhere</a> pracuje na tom, aby začátečníci a učitelé mohli zdarma provozovat jednoduché projekty na internetu. Budete si tam muset vytvořit účet a zadat následující údaje, aby Mu mohlo váš projekt zprovoznit.

source: Copy your username on PythonAnywhere into here:
cs: Sem zkopírujte své uživatelské jméno (username), které máte u PythonAnywhere.

source: Copy your <a href='https://www.pythonanywhere.com/account/#api_token'>secret API token from PythonAnywhere</a> into here:
cs: Sem zkopírujte svůj <a href='https://www.pythonanywhere.com/account/#api_token'> tajný PythonAnywhere API token:

source: secret api token
cs: tajný api token

source: Server location ('www' is a safe default):
cs: Umístění serveru ('www' je bezpečné výchozí nastavení)

source: Automatically detect
cs: Rozpoznat automaticky
ta: தானாகவே கண்டறியவும்

source: Please select the language for Mu's user interface from the choices listed below. <strong>Restart Mu for these changes to take effect.</strong>
cs: Vyberte si, prosím, jazyk uživatelského rozhraní Mu z níže uvedených možností. <strong>Aby sa tyto změny projevily, restartujte Mu.</strong>
ta: கீழே பட்டியலிடப்பட்டுள்ள தேர்வுகளிலிருந்து MU இன் பயனர் இடைமுகத்திற்கான மொழியைத் தேர்ந்தெடுக்கவும். <strong> இந்த மாற்றங்கள் நடைமுறைக்கு வர MU ஐ மறுதொடக்கம் செய்யுங்கள். </strong>

source: How to flash MicroPython to your device
cs: Jak zapsat MicroPython do vašeho zařízení
ta: உங்கள் சாதனத்திற்கு மைக்ரோபிதானை எவ்வாறு ஒளிரச் செய்வது

source: &nbsp;1. Determine the type of device (ESP8266 or ESP32)<br />&nbsp;2. Download firmware from the <a href="https://micropython.org/download" style="color:#039be5;">https://micropython.org/download</a><br/>&nbsp;3. Connect your device<br/>&nbsp;4. Load the .bin file below using the 'Browse' button<br/>&nbsp;5. Press 'Erase & write firmware'
cs: &nbsp;1. Zjistěte typ zařízení (ESP8266 alebo ESP32)<br />&nbsp;2. Stáhněte si firmware ze stránky <a href="https://micropython.org/download" style="color:#039be5;">https://micropython.org/download</a><br/>&nbsp;3. Připojte svoje zařízení<br/>&nbsp;4. Tlačítkem 'Prohledat' načtěte .bin soubor<br/>&nbsp;5. Zmáčkněte 'Vymazat a zapsat firmware'
ta: & nbsp; 1. சாதனத்தின் வகையைத் தீர்மானிக்கவும் (ESP8266 அல்லது ESP32) <br /> & nbsp; 2. <a href="https://micropython.org/download" style"color:#039be5 ;"> https://micropython.org/download </a> <br/> & nbsp; 3. உங்கள் சாதனத்தை இணைக்கவும் <br/> & nbsp; 4. 'உலாவு' பொத்தானைப் பயன்படுத்தி கீழே .bin கோப்பை ஏற்றவும் <br/> & nbsp; 5. 'அழி, ஃபார்ம்வேரை எழுதுங்கள்' என்பதை அழுத்தவும்

source: Device:
cs: Zařízení:

source: Choose device type:
cs: Vyberte typ zařízení:

source: Browse
cs: Prohledat
ta: உலாவு

source: Erase && write firmware
cs: Vymazat a zapsat firmware
ta: அழி && ஃபார்ம்வேரை எழுதுங்கள்

source: Select MicroPython firmware (.bin)
cs: Vyberte MicroPython firmware (.bin)

source: Firmware (*.bin)
cs: Firmvware (*.bin)

source: Third Party Packages
cs: Balíčky třetích stran
ta: மூன்றாம் தரப்பு தொகுப்புகள்

source: ESP Firmware flasher
cs: Zapisovač firmwaru do ESP
ta: ஈஎஸ்பி ஃபார்ம்வேர் ஃப்ளாஷர்

source: Select Language
cs: Vybrat jazyk
ta: மொழியை தேர்ந்தெடுங்கள்

source: Third Party Package Status
cs: Stav balíčku třetích stran
ta: மூன்றாம் தரப்பு தொகுப்பு நிலை

source: Tidy
cs: Uklidit
ta: நேர்த்தியான

source: Tidy up the layout of your code.
cs: Přeformátuje kód, aby byl přehledný.
ta: உங்கள் குறியீட்டின் தளவமைப்பை நேர்த்தியாக.

source: Close file
cs: Zavřít soubor
ta: கோப்பை மூடு

source: Copy selected text to REPL
cs: Zkopírovat vybraný text do REPL
ta: தேர்ந்தெடுக்கப்பட்ட உரையை மாற்றியமைக்க நகலெடுக்கவும்

source: Filesystem on
cs: Souborový systém na
ta: கோப்பு முறைமை

source: Uploading to PythonAnywhere. This may take some time and pause at the end (as the website is started).
cs: Nahrávám na PythonAnywhere. Může to chvíli trvat a Mu se pozastaví (v okamžiku rozběhnutí webové stránky).

source: <p>Your website was successfully deployed.</p><p>You can see it here:</p><a href='https://{domain}'>https://{domain}</a>
cs: <p>Vaše webová stránka se úspěšně vytvořila.</p><p>Zde si ji můžete prohlédnout</p><a href='https://{domain}'>https://{domain}</a>

source: Please check your PythonAnywhere settings or connection and ensure you're using a recent version of Mu.<br/><br/>Alternatively, <a href='https://github.com/mu-editor/mu/issues/new/choose'>submit a bug report</a>.
cs: Prosím, ověřte své nastavení PythonAnywhere nebo připojení a ujistěte se, že používáte aktuální verzi Mu.<br/><br/>Popřípadě <a href='https://github.com/mu-editor/mu/issues/new/choose'>nahlašte chybu</a>.

source: Detected new {} device: {}.
cs: Bylo rozpoznané nové zařízení {}: {}.
ta: புதிய {} சாதனம் கண்டறியப்பட்டது: {}.

source: Copying '{}' to device.
cs: Kopíruji soubor '{}' do zařízení.
ta: சாதனத்திற்கு '{}' நகலெடுக்கிறது.

source: '{}' successfully copied to device.
cs: Na zařízení se úspěšně zkopíroval soubor '{}'.
ta: '{}' சாதனத்திற்கு வெற்றிகரமாக நகலெடுக்கப்பட்டது.

source: Write to main.py on device
cs: Zapsat do souboru main.py na zariadení
ta: சாதனத்தில் main.py க்கு எழுதுங்கள்

source: No device connected.
cs: Není připojené žádné zařízení.
ta: சாதனம் எதுவும் இணைக்கப்படவில்லை.

source: Hello, World!
cs: Ahoj, světe!
ta: வணக்கம், உலகம்!

source: Computers aren’t the thing. They’re the thing that gets us to the thing.
cs: Počítač není ta Věc. Počítač je věc, která nám umožňuje dělat Věci.

source: Don't stare at a blank screen - try something out.
cs: Nezírej na prázdnou obrazovku - zkus něco udělat.

source: If you're stuck - try explaining it to a rubber duck.
cs: Když si nevíš rady, vysvětli svůj problém malé gumové kachničce.

source: It's ok to be stuck, go for a walk and then try again (:
cs: Je v pořádku, když si nevíš rady. Jdi se projít a zkus to znovu (:

source: It's not a mistake to make an error.
cs: Není chybou udělat chybu.

source: Errors are there to learn from them. Then avoid them.
cs: Chyby jsou tu, abychom se z nich poučili. A potom se jim vyhnuli.

source: Don't look backwards for very long. We keep moving forward.
cs: Nedívej se zpátky příliš dlouho. Pořád se pohybujeme kupředu.

source: Keep moving forward.
cs: Pořád kupředu

source: Computers are not humans. There is no need arguing with them.
cs: Počítače nejsou lidé. Nemá smysl se s nimi hádat.

source: Embrace change and seek growth.
cs: Podporuj změny a hledej růst.

source: Live, laugh, learn!
cs: Žij, směj se a uč se!

source: Let's get coding!
cs: Pojďme psát programy!

source: Don't be afraid of coding, we all learn by making mistakes!
cs: Neboj se programování, všichni se učíme z vlastních chyb!

source: {} compatible
cs: {} kompatibilní

source: Device changed to {}.
cs: Zařízení se změnilo na {}.
ta: சாதனம் {to ஆக மாற்றப்பட்டது.

source: Successfully cleaned the code. Use CTRL-Z to undo.
cs: Kód byl úspěšně uklizený. Zmáčkněte CTRL-Z pro vrácení změn.
ta: குறியீட்டை வெற்றிகரமாக சுத்தம் செய்தது. செயல்தவிர்க்க Ctrl-Z ஐப் பயன்படுத்தவும்.

source: Your code contains problems.
cs: Váš kód obsahuje chyby.
ta: உங்கள் குறியீட்டில் சிக்கல்கள் உள்ளன.

source: These must be fixed before tidying will work. Please use the 'Check' button to highlight these problems.
cs: Aby bylo možné kód uklidit, je nutné tyto chybyopravit. Pokud chcete tyto chyby zvýraznit, použijte tlačítko "Zkontrolovat".
ta: நேர்த்தியாக வேலை செய்யும் முன் இவை சரி செய்யப்பட வேண்டும். இந்த சிக்கல்களை முன்னிலைப்படுத்த 'செக்' பொத்தானைப் பயன்படுத்தவும்.

source: Write code for boards running CircuitPython.
cs: Programujte vývojové desky, na ktorých beží CircuitPython.
ta: சர்க்யுத்தானை இயக்கும் பலகைகளுக்கான குறியீட்டை எழுதுங்கள்.

source: Permission error running mount command
cs: Chyba přístupových práv při spuštění příkazu mount
ta: அனுமதி பிழை மவுண்ட் கட்டளையை இயக்குகிறது

source: The mount command ("{}") returned an error: {}. Mu will continue as if a device isn't plugged in.
cs: Příkaz pro připojení ("{}") vrátil chybu: {}. Mu bude pokračovat, jako by zařízení nebylo připojené.
ta: மவுண்ட் கட்டளை ("{}") ஒரு பிழையை அளித்தது: {}. ஒரு சாதனம் செருகப்படாதது போல் MU தொடரும்.

source: Could not find an attached CircuitPython device.
cs: Nepodařilo se najít připojené CircuitPython zařízení.
ta: இணைக்கப்பட்ட சர்க்யூட்ட்பிதான் சாதனத்தைக் கண்டுபிடிக்க முடியவில்லை.

source: Python files for CircuitPython devices are stored on the device. Therefore, to edit these files you need to have the device plugged in. Until you plug in a device, Mu will use the directory found here: {} ...to store your code.
cs: Python soubory pro CircuitPython zařízení jsou uložené přímo na zařízení. Pokud je chcete upravovat, musíte mít toto zařízení připojené. Pokud zařízení nepřipojíte, Mu bude na ukládání vašeho kódu používat adresář, který najdete zde: {}
ta: சர்க்கெபிதான் சாதனங்களுக்கான பைதான் கோப்புகள் சாதனத்தில் சேமிக்கப்படுகின்றன. எனவே, இந்த கோப்புகளைத் திருத்த நீங்கள் சாதனம் செருகப்பட வேண்டும். நீங்கள் ஒரு சாதனத்தை செருகும் வரை, MU இங்கே காணப்படும் கோப்பகத்தைப் பயன்படுத்தும்: {} ... உங்கள் குறியீட்டை சேமிக்க.

source: Write MicroPython on ESP8266/ESP32 boards.
cs: Programujte v jazyku MicroPython na vývojových deskách ESP8266/ESP32.
ta: ESP8266/ESP32 பலகைகளில் மைக்ரோபிதானை எழுதுங்கள்.

source: Run your code directly on the {board_name} via the REPL.
cs: Spustí váš kód přímo na vývojové desce {board_name} přes REPL.
ta: உங்கள் குறியீட்டை நேரடியாக {board_name at இல் REPL வழியாக இயக்கவும்.

source: Access the file system on {board_name}.
cs: Zpřístupní souborový systém na zařízení {board_name}.
ta: கோப்பு முறைமையை {board_name on இல் அணுகவும்.

source: Use the REPL to live-code on the {board_name}.
cs: Použite REPL pro živé programování na vývojové desce {board_name}.
ta: {போர்டு_பெயர் at இல் லைவ்-குறியீட்டிற்கு REPR ஐப் பயன்படுத்தவும்.

source: Cannot run anything without any active editor tabs.
cs: Nic se nedá spustit bez aktivních karet editoru.
ta: எந்த செயலில் உள்ள எடிட்டர் தாவல்களும் இல்லாமல் எதையும் இயக்க முடியாது.
