Repository: mu-editor/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: cs, ja, ta

source: Running transfers the content of the current tab onto the device. It seems like you don't have any tabs open.
cs: Spouští se přenos obsahu aktuální karty do zařízení. Zdá se, že nemáte otevřené žádné karty.
ta: இயக்குவது தற்போதைய தாவலின் உள்ளடக்கத்தை சாதனத்தில் மாற்றுகிறது. உங்களிடம் எந்த தாவல்களும் திறக்கப்படவில்லை என்று தெரிகிறது.

source: Could not find an attached {board_name}
cs: Nepodařilo se najít připojenou vývojovou desku {board_name}
ta: இணைக்கப்பட்ட {போர்டு_பேம்} கண்டுபிடிக்க முடியவில்லை

source: {board_name} board
cs: deska {board_name}
ta: {board_name} பலகை

source: Write MicroPython directly on Lego Spike devices.
cs: Programujte zařízení Lego Spike přímo v jazyku MicroPython.
ta: லெகோ ஸ்பைக் சாதனங்களில் மைக்ரோசிதானை நேரடியாக எழுதுங்கள்.

source: Your script is too long and code minification is disabled
cs: Váš skript je příliš dlouhý a minifikace kódu je vypnutá
ta: உங்கள் ஸ்கிரிப்ட் மிக நீளமானது மற்றும் குறியீடு குறைப்பு முடக்கப்பட்டுள்ளது

source: Problem minifying script
cs: Problém s minifkováním skriptu
ta: ஸ்கிரிப்டைக் குறைப்பதில் சிக்கல்

source: Cannot save a custom hex file to a local directory.
cs: Není možné uložit vlastní binární soubor do lokálního adresáře.
ta: தனிப்பயன் ஹெக்ஸ் கோப்பை உள்ளூர் கோப்பகத்தில் சேமிக்க முடியாது.

source: When a custom hex file is configured in the settings a local directory cannot be used to save the final hex file.
cs: Pokud je v nastaveních nakonfigurovaný vlastní binární soubor, není možné použít lokální adresář k uložení výsledného binárního souboru.

source: Cannot use a custom hex file without micro:bit port.
cs: Není možné použít vlastní hex soubor bez portu micro:bit-u.
ta: மைக்ரோ: பிட் போர்ட் இல்லாமல் தனிப்பயன் ஹெக்ஸ் கோப்பைப் பயன்படுத்த முடியாது.

source: Mu was unable to detect the micro:bit serial port. Normally this is okay, as Mu can inject the Python code into the hex to flash. However, this cannot be done with a custom hex file.
cs: Mu se nepodařilo zjistit sériový port micro:bit-u. Za normálních okolností je to v pořádku, protože Mu může vložit kód v jazyku Python do binárního souboru, který bude zapsán na vývojovou desku micro:bit. To však není možné udělat s vlastním binárním souborem.
ta: மைக் மைக்ரோ: பிட் சீரியல் போர்ட்டைக் கண்டறிய முடியவில்லை. பொதுவாக இது பரவாயில்லை, ஏனெனில் MU பைதான் குறியீட்டை ஹெக்ஸில் ஃபிளாஷ் செய்ய செலுத்த முடியும். இருப்பினும், தனிப்பயன் ஹெக்ஸ் கோப்பு மூலம் இதைச் செய்ய முடியாது.

source: Flashing the micro:bit
cs: Zapisuji na micro:bit
ta: மைக்ரோ ஒளிரும்: பிட்

source: Copied code onto micro:mubit.
cs: Kód byl zkopírovaný na vývojovou desku micro:bit.

source: Write MicroPython directly on a Raspberry Pi Pico.
cs: Programujte Raspberry Pi Pico přímo v jazyku MicroPython.
ta: ராஸ்பெர்ரி பை பைக்கோவில் மைக்ரோபிதானை நேரடியாக எழுதுங்கள்.

source: Use MicroPython on the Pyboard line of boards.
cs: Používejte MicroPython na vývojových deskách řady Pyboard.

source: Could not find an attached PyBoard device.
cs: Nepodařilo se najít připojené PyBoard zařízení.
ta: இணைக்கப்பட்ட பைபோர்டு சாதனத்தைக் கண்டுபிடிக்க முடியவில்லை.

source: Python files for PyBoard MicroPython devices are stored on the device. Therefore, to edit these files you need to have the device plugged in. Until you plug in a device, Mu will use the directory found here: {} ...to store your code.
cs: Python soubory pro PyBoard zařízení s jazykom MicroPython jsou uložené příamo v zařízení. Pokud je chcete upravovat, musíte mít toto zařízení pripojené. Pokud zařízení nepřipojíte, Mu bude na ukládání vašeho kódu používat adresář, který najdete zde: {}
ta: பைபோர்டு மைக்ரோபிதான் சாதனங்களுக்கான பைதான் கோப்புகள் சாதனத்தில் சேமிக்கப்படுகின்றன. எனவே, இந்த கோப்புகளைத் திருத்த நீங்கள் சாதனம் செருகப்பட வேண்டும். நீங்கள் ஒரு சாதனத்தை செருகும் வரை, MU இங்கே காணப்படும் கோப்பகத்தைப் பயன்படுத்தும்: {} ... உங்கள் குறியீட்டை சேமிக்க.

source: Put
cs: Nahrát

source: Put the current program to the device.
cs: Nahraje aktuální program do zařízení

source: Get
cs: Stáhnout

source: Get the current program from the device.
cs: Stáhne aktuální program ze zařízení

source: Build simple websites with the "Flask" web framework.
cs: Tvořte jednoduché webové stránky se softwarovým rámcom "Flask".
ta: "பிளாஸ்க்" வலை கட்டமைப்பைக் கொண்டு எளிய வலைத்தளங்களை உருவாக்குங்கள்.

source: Run the web server.
cs: Spustí webový server.
ta: வலை சேவையகத்தை இயக்கவும்.

source: Deploy website to PythonAnywhere.
cs: Nahraje webovou stránku na PythonAnywhere.

source: Open your website in a browser.
cs: Otevře vaši webovou stránku v prohlížeči.
ta: உங்கள் வலைத்தளத்தை உலாவியில் திறக்கவும்.

source: Templates
cs: Šablony
ta: வார்ப்புருக்கள்

source: Load HTML templates used by your website.
cs: Načte HTML šablony použité ve vaší webové stránce.
ta: உங்கள் வலைத்தளத்தால் பயன்படுத்தப்படும் HTML வார்ப்புருக்கள் ஏற்றவும்.

source: Load CSS files used by your website.
cs: Načte CSS sobory použité ve vaší webové stránce.
ta: உங்கள் வலைத்தளத்தால் பயன்படுத்தப்படும் CSS கோப்புகளை ஏற்றவும்.

source: Open the directory containing images used by your website.
cs: Otevře adresář obsahující obrázky použité ve vaší webové stránce.
ta: உங்கள் வலைத்தளத்தால் பயன்படுத்தப்படும் படங்களைக் கொண்ட கோப்பகத்தைத் திறக்கவும்.

source: Stop the web server.
cs: Zastaví webový server.
ta: வலை சேவையகத்தை நிறுத்துங்கள்.

source: This is not a Python file!
cs: Toto není Python soubor!
ta: இது பைதான் கோப்பு அல்ல!

source: Mu is only able to serve a Python file. Please make sure the current tab in Mu is the one for your web application and then try again.
cs: Mu dokáže pracovat pouze se soubory pro Python. Ujistěte se, prosím, že stávající tab je ten pro vaši webovou aplikaci a poté zkuste znovu.
ta: MU ஒரு பைதான் கோப்பை மட்டுமே பரிமாற முடியும். MU இல் உள்ள தற்போதைய தாவல் உங்கள் வலை பயன்பாட்டிற்கு ஒன்றாகும் என்பதை உறுதிப்படுத்தவும், பின்னர் மீண்டும் முயற்சிக்கவும்.

source: Cannot find template directory!
cs: Nepodařilo sa najít adresář se šablonami!
ta: வார்ப்புரு கோப்பகத்தைக் கண்டுபிடிக்க முடியவில்லை!

source: To serve your web application, there needs to be a 'templates' directory in the same place as your web application's Python code. Please fix this and try again. (Hint: Mu was expecting the `templates` directory to be here: )
cs: Pro obsloužení vaší webové aplikace, adresář s vaším kódem Pythonu musí obsahovat i složku 'templates'. Opravte tuto chybu a zkuste znovu. (Nápověda: Mu očekával, že se adresář 'templates' nachází zde: )
ta: உங்கள் வலை பயன்பாட்டிற்கு சேவை செய்ய, உங்கள் வலை பயன்பாட்டின் பைதான் குறியீட்டின் அதே இடத்தில் ஒரு 'வார்ப்புருக்கள்' அடைவு இருக்க வேண்டும். இதை சரிசெய்து மீண்டும் முயற்சிக்கவும். (குறிப்பு: `வார்ப்புருக்கள்` அடைவு இங்கே இருக்கும் என்று மு எதிர்பார்த்தார் :)

source: Too many web apps.
cs: Příliš mnoho webových aplikací.

source: Please ensure you only have one open Python file for a web application.
cs: Ujistěte se, že máte otevřený jen jeden soubor Pythonu pro vaší webovou aplikaci

source: Cannot Open Website - Server not Running.
cs: Webová stránka se nedá otevřít - server není spuštěný.
ta: வலைத்தளத்தைத் திறக்க முடியாது - சேவையகம் இயங்கவில்லை.

source: You must have the local web server running in order to view your website in a browser. Click on the 'Run' button to start the server and then try again.
cs: Pokud chcete zobrazit vaši webovou stránku v prohlížeči, musíte mít spuštěný lokální webový server. Spustíte ho kliknutím na tlačítko 'Spustit' a potom to skuste znovu.
ta: உங்கள் வலைத்தளத்தை உலாவியில் காண உள்ளூர் வலை சேவையகம் இயங்க வேண்டும். சேவையகத்தைத் தொடங்க 'ரன்' பொத்தானைக் கிளிக் செய்து மீண்டும் முயற்சிக்கவும்.

source: Mu is only able to deploy a Python file. Please make sure the current tab in Mu is the one for your web application and then try again.
cs: Mu dokáže nahrát pouze soubory Pythonu. Ujistěte se, prosím, že váš aktuální tab je určenž pro vaši webovou aplikaci a poté to zkuste znovu.

source: Python3 (Jupyter)
ta: பைதான் 3 (ஜூபிட்டர்)

source: Mu
ta: மு

source: compatible
ta: இணக்கமான

source: CircuitPython
ta: சர்க்யூதான்

source: If your Circuit Python device is plugged in, you need to "Share with Linux" on the CIRCUITPY drive in the "Files" app then restart Mu.
ta: உங்கள் சர்க்யூட் பைதான் சாதனம் செருகப்பட்டால், நீங்கள் "கோப்புகள்" பயன்பாட்டில் உள்ள சர்க்யூட் டிரைவில் "லினக்ஸுடன் பகிர வேண்டும்", பின்னர் MU ஐ மறுதொடக்கம் செய்ய வேண்டும்.

source: ESP MicroPython
ta: ஈஎஸ்பி மைக்ரோபிதான்

source: REPL
ta: படிஓடுஅச்சுமீண்டும்

source: Lego MicroPython
ta: லெகோ மைக்ரோபிதான்

source: BBC micro:bit
ta: பிபிசி மைக்ரோ: பிட்

source: When a custom hex file is configured in the settings a local directory cannot be used to saved the final hex file.
ta: அமைப்புகளில் தனிப்பயன் ஹெக்ஸ் கோப்பு கட்டமைக்கப்படும்போது, இறுதி ஹெக்ஸ் கோப்பை சேமிக்க உள்ளூர் கோப்பகத்தைப் பயன்படுத்த முடியாது.

source: Runtime
ta: இயக்க நேரம்

source: micro:bit
ta: மைக்ரோ: பிட்

source: Pyboard MicroPython
ta: பைபோர்டு மைக்ரோபிதான்

source: Use MicroPython on the Pyboard line of boards
ta: பலகைகளின் பைபோர்டு வரிசையில் மைக்ரோபிதானைப் பயன்படுத்தவும்

source: Pygame Zero
ta: பைகேம் பூஜ்ஜியம்

source: Python 3
ta: பைதான் 3

source: Web
ta: வலை
